{
    "0": {
        "url": "https://en.wikipedia.org/wiki/Web_crawler",
        "text": "Web crawler - Wikipedia Jump to content Main menu Main menu move to sidebar hide Navigation Main page Contents Current events Random article About Wikipedia Contact us Contribute Help Learn to edit Community portal Recent changes Upload file Special pages Search Search Appearance Donate Create account Log in Personal tools Donate Create account Log in Pages for logged out editors learn more Contributions Talk Contents move to sidebar hide (Top) 1 Nomenclature 2 Overview 3 Crawling policy Toggle Crawling policy subsection 3.1 Selection policy 3.1.1 Restricting followed links 3.1.2 URL normalization 3.1.3 Path-ascending crawling 3.1.4 Focused crawling 3.1.4.1 Academic focused crawler 3.1.4.2 Semantic focused crawler 3.2 Re-visit policy 3.3 Politeness policy 3.4 Parallelization policy 4 Architectures 5 Security 6 Crawler identification 7 Crawling the deep web 8 Visual vs programmatic crawlers 9 List of web crawlers Toggle List of web crawlers subsection 9.1 Historical web crawlers 9.2 In-house web crawlers 9.3 Commercial web crawlers 9.4 Open-source crawlers 10 See also 11 References 12 Further reading Toggle the table of contents Web crawler 47 languages Afrikaans العربية Azərbaycanca Boarisch Català Čeština Cymraeg الدارجة Deutsch Eesti Ελληνικά Español Euskara فارسی Français 한국어 Հայերեն Hrvatski Bahasa Indonesia Interlingua Italiano עברית Latviešu Lietuvių Magyar Bahasa Melayu Nederlands Nedersaksies 日本語 Norsk bokmål Norsk nynorsk Олык марий Polski Português Română Runa Simi Русский Simple English Српски / srpski Suomi Svenska தமிழ் ไทย Türkçe Українська 文言 中文 Edit links Article Talk English Read Edit View history Tools Tools move to sidebar hide Actions Read Edit View history General What links here Related changes Upload file Permanent link Page information Cite this page Get shortened URL Download QR code Print/export Download as PDF Printable version In other projects Wikidata item Appearance move to sidebar hide From Wikipedia, the free encyclopedia Software which systematically browses the World Wide Web This article is about the internet bot. For the search engine, see WebCrawler . \"Web spider\" redirects here and is not to be confused with Spider web . \"Spiderbot\" redirects here. For the video game, see Arac (video game) . Architecture of a Web crawler Web crawler , sometimes called a spider or spiderbot and often shortened to crawler , is an Internet bot that systematically browses the World Wide Web and that is typically operated by search engines for the purpose of Web indexing ( web spidering ). [ 1 ] Web search engines and some other websites use Web crawling or spidering software to update their web content or indices of other sites' web content. Web crawlers copy pages for processing by a search engine, which indexes the downloaded pages so that users can search more efficiently. Crawlers consume resources on visited systems and often visit sites unprompted. Issues of schedule, load, and \"politeness\" come into play when large collections of pages are accessed. Mechanisms exist for public sites not wishing to be crawled to make this known to the crawling agent. For example, including a robots.txt file can request bots to index only parts of a website, or nothing at all. The number of Internet pages is extremely large; even the largest crawlers fall short of making a complete index. For this reason, search engines struggled to give relevant search results in the early years of the World Wide Web, before 2000. Today, relevant results are given almost instantly. Crawlers can validate hyperlinks and HTML code. They can also be used for web scraping and data-driven programming . Nomenclature [ edit ] A web crawler is also known as a spider , [ 2 ] an ant , an automatic indexer , [ 3 ] or (in the FOAF software context) a Web scutter . [ 4 ] Overview [ edit ] A Web crawler starts with a list of URLs to visit. Those first URLs are called the seeds . As the crawler visits these URLs, by communicating with web servers that respond to those URLs, it identifies all the hyperlinks in the retrieved web pages and adds them to the list of URLs to visit, called the crawl frontier . URLs from the frontier are recursively visited according to a set of policies. If the crawler is performing archiving of websites (or web archiving ), it copies and saves the information as it goes. The archives are usually stored in such a way they can be viewed, read and navigated as if they were on the live web, but are preserved as 'snapshots'. [ 5 ] The archive is known as the repository and is designed to store and manage the collection of web pages . The repository only stores HTML pages and these pages are stored as distinct files. A repository is similar to any other system that stores data, like a modern-day database. The only difference is that a repository does not need all the functionality offered by a database system. The repository stores the most recent version of the web page retrieved by the crawler. [ citation needed ] The large volume implies the crawler can only download a limited number of the Web pages within a given time, so it needs to prioritize its downloads. The high rate of change can imply the pages might have already been updated or even deleted. The number of possible URLs crawled being generated by server-side software has also made it difficult for web crawlers to avoid retrieving duplicate content . Endless combinations of HTTP GET (URL-based) parameters exist, of which only a small selection will actually return unique content. For example, a simple online photo gallery may offer three options to users, as specified through HTTP GET parameters in the URL. If there exist four ways to sort images, three choices of thumbnail size, two file formats, and an option to disable user-provided content, then the same set of content can be accessed with 48 different URLs, all of which may be linked on the site. This mathematical combination creates a problem for crawlers, as they must sort through endless combinations of relatively minor scripted changes in order to retrieve unique content. As Edwards et al. noted, \"Given that the bandwidth for conducting crawls is neither infinite nor free, it is becoming essential to crawl the Web in not only a scalable, but efficient way, if some reasonable measure of quality or freshness is to be maintained.\" [ 6 ] A crawler must carefully choose at each step which pages to visit next. Crawling policy [ edit ] The behavior of a Web crawler is the outcome of a combination of policies: [ 7 ] a selection policy which states the pages to download, a re-visit policy which states when to check for changes to the pages, a politeness policy that states how to avoid overloading websites . a parallelization policy that states how to coordinate distributed web crawlers. Selection policy [ edit ] Given the current size of the Web, even large search engines cover only a portion of the publicly available part. A 2009 study showed even large-scale search engines index no more than 40–70% of the indexable Web; [ 8 ] a previous study by Steve Lawrence and Lee Giles showed that no search engine indexed more than 16% of the Web in 1999. [ 9 ] As a crawler always downloads just a fraction of the Web pages , it is highly desirable for the downloaded fraction to contain the most relevant pages and not just a random sample of the Web. This requires a metric of importance for prioritizing Web pages. The importance of a page is a function of its intrinsic quality, its popularity in terms of links or visits, and even of its URL (the latter is the case of vertical search engines restricted to a single top-level domain , or search engines restricted to a fixed Web site). Designing a good selection policy has an added difficulty: it must work with partial information, as the complete set of Web pages is not known during crawling. Junghoo Cho et al. made the first study on policies for crawling scheduling. Their data set was a 180,000-pages crawl from the stanford.edu domain, in which a crawling simulation was done with different strategies. [ 10 ] The ordering metrics tested were breadth-first , backlink count and partial PageRank calculations. One of the conclusions was that if the crawler wants to download pages with high Pagerank early during the crawling process, then the partial Pagerank strategy is the better, followed by breadth-first and backlink-count. However, these results are for just a single domain. Cho also wrote his PhD dissertation at Stanford on web crawling. [ 11 ] Najork and Wiener performed an actual crawl on 328 million pages, using breadth-first ordering. [ 12 ] They found that a breadth-first crawl captures pages with high Pagerank early in the crawl (but they did not compare this strategy against other strategies). The explanation given by the authors for this result is that \"the most important pages have many links to them from numerous hosts, and those links will be found early, regardless of on which host or page the crawl originates.\" Abiteboul designed a crawling strategy based on an algorithm called OPIC (On-line Page Importance Computation). [ 13 ] In OPIC, each page is given an initial sum of \"cash\" that is distributed equally among the pages it points to. It is similar to a PageRank computation, but it is faster and is only done in one step. An OPIC-driven crawler downloads first the pages in the crawling frontier with higher amounts of \"cash\". Experiments were carried in a 100,000-pages synthetic graph with a power-law distribution of in-links. However, there was no comparison with other strategies nor experiments in the real Web. Boldi et al. used simulation on subsets of the Web of 40 million pages from the .it domain and 100 million pages from the WebBase crawl, testing breadth-first against depth-first, random ordering and an omniscient strategy. The comparison was based on how well PageRank computed on a partial crawl approximates the true PageRank value. Some visits that accumulate PageRank very quickly (most notably, breadth-first and the omniscient visit) provide very poor progressive approximations. [ 14 ] [ 15 ] Baeza-Yates et al. used simulation on two subsets of the Web of 3 million pages from the .gr and .cl domain, testing several crawling strategies. [ 16 ] They showed that both the OPIC strategy and a strategy that uses the length of the per-site queues are better than breadth-first crawling, and that it is also very effective to use a previous crawl, when it is available, to guide the current one. Daneshpajouh et al. designed a community based algorithm for discovering good seeds. [ 17 ] Their method crawls web pages with high PageRank from different communities in less iteration in comparison with crawl starting from random seeds. One can extract good seed from a previously-crawled-Web graph using this new method. Using these seeds, a new crawl can be very effective. Restricting followed links [ edit ] A crawler may only want to seek out HTML pages and avoid all other MIME types . In order to request only HTML resources, a crawler may make an HTTP HEAD request to determine a Web resource's MIME type before requesting the entire resource with a GET request. To avoid making numerous HEAD requests, a crawler may examine the URL and only request a resource if the URL ends with certain characters such as .html, .htm, .asp, .aspx, .php, .jsp, .jspx or a slash. This strategy may cause numerous HTML Web resources to be unintentionally skipped. Some crawlers may also avoid requesting any resources that have a \"?\" in them (are dynamically produced) in order to avoid spider traps that may cause the crawler to download an infinite number of URLs from a Web site. This strategy is unreliable if the site uses URL rewriting to simplify its URLs. URL normalization [ edit ] Main article: URL normalization Crawlers usually perform some type of URL normalization in order to avoid crawling the same resource more than once. The term URL normalization , also called URL canonicalization , refers to the process of modifying and standardizing a URL in a consistent manner. There are several types of normalization that may be performed including conversion of URLs to lowercase, removal of \".\" and \"..\" segments, and adding trailing slashes to the non-empty path component. [ 18 ] Path-ascending crawling [ edit ] Some crawlers intend to download/upload as many resources as possible from a particular web site. So path-ascending crawler was introduced that would ascend to every path in each URL that it intends to crawl. [ 19 ] For example, when given a seed URL of http://llama.org/hamster/monkey/page.html, it will attempt to crawl /hamster/monkey/, /hamster/, and /. Cothey found that a path-ascending crawler was very effective in finding isolated resources, or resources for which no inbound link would have been found in regular crawling. Focused crawling [ edit ] Main article: Focused crawler The importance of a page for a crawler can also be expressed as a function of the similarity of a page to a given query. Web crawlers that attempt to download pages that are similar to each other are called focused crawler or topical crawlers . The concepts of topical and focused crawling were first introduced by Filippo Menczer [ 20 ] [ 21 ] and by Soumen Chakrabarti et al. [ 22 ] The main problem in focused crawling is that in the context of a Web crawler, we would like to be able to predict the similarity of the text of a given page to the query before actually downloading the page. A possible predictor is the anchor text of links; this was the approach taken by Pinkerton [ 23 ] in the first web crawler of the early days of the Web. Diligenti et al. [ 24 ] propose using the complete content of the pages already visited to infer the similarity between the driving query and the pages that have not been visited yet. The performance of a focused crawling depends mostly on the richness of links in the specific topic being searched, and a focused crawling usually relies on a general Web search engine for providing starting points. Academic focused crawler [ edit ] An example of the focused crawlers are academic crawlers, which crawls free-access academic related documents, such as the citeseerxbot , which is the crawler of CiteSeer X search engine. Other academic search engines are Google Scholar and Microsoft Academic Search etc. Because most academic papers are published in PDF formats, such kind of crawler is particularly interested in crawling PDF, PostScript files, Microsoft Word including their zipped formats. Because of this, general open-source crawlers, such as Heritrix , must be customized to filter out other MIME types , or a middleware is used to extract these documents out and import them to the focused crawl database and repository. [ 25 ] Identifying whether these documents are academic or not is challenging and can add a significant overhead to the crawling process, so this is performed as a post crawling process using machine learning or regular expression algorithms. These academic documents are usually obtained from home pages of faculties and students or from publication page of research institutes. Because academic documents make up only a small fraction of all web pages, a good seed selection is important in boosting the efficiencies of these web crawlers. [ 26 ] Other academic crawlers may download plain text and HTML files, that contains metadata of academic papers, such as titles, papers, and abstracts. This increases the overall number of papers, but a significant fraction may not provide free PDF downloads. Semantic focused crawler [ edit ] Another type of focused crawlers is semantic focused crawler, which makes use of domain ontologies to represent topical maps and link Web pages with relevant ontological concepts for the selection and categorization purposes. [ 27 ] In addition, ontologies can be automatically updated in the crawling process. Dong et al. [ 28 ] introduced such an ontology-learning-based crawler using a support-vector machine to update the content of ontological concepts when crawling Web pages. Re-visit policy [ edit ] The Web has a very dynamic nature, and crawling a fraction of the Web can take weeks or months. By the time a Web crawler has finished its crawl, many events could have happened, including creations, updates, and deletions. From the search engine's point of view, there is a cost associated with not detecting an event, and thus having an outdated copy of a resource. The most-used cost functions are freshness and age. [ 29 ] Freshness : This is a binary measure that indicates whether the local copy is accurate or not. The freshness of a page p in the repository at time t is defined as: F p ( t ) = { 1 i f p i s e q u a l t o t h e l o c a l c o p y a t t i m e t 0 o t h e r w i s e {\\displaystyle F_{p}(t)={\\begin{cases}1&{\\rm {if}}~p~{\\rm {~is~equal~to~the~local~copy~at~time}}~t\\\\0&{\\rm {otherwise}}\\end{cases}}} Age : This is a measure that indicates how outdated the local copy is. The age of a page p in the repository, at time t is defined as: A p ( t ) = { 0 i f p i s n o t m o d i f i e d a t t i m e t t − m o d i f i c a t i o n t i m e o f p o t h e r w i s e {\\displaystyle A_{p}(t)={\\begin{cases}0&{\\rm {if}}~p~{\\rm {~is~not~modified~at~time}}~t\\\\t-{\\rm {modification~time~of}}~p&{\\rm {otherwise}}\\end{cases}}} Coffman et al. worked with a definition of the objective of a Web crawler that is equivalent to freshness, but use a different wording: they propose that a crawler must minimize the fraction of time pages remain outdated. They also noted that the problem of Web crawling can be modeled as a multiple-queue, single-server polling system, on which the Web crawler is the server and the Web sites are the queues. Page modifications are the arrival of the customers, and switch-over times are the interval between page accesses to a single Web site. Under this model, mean waiting time for a customer in the polling system is equivalent to the average age for the Web crawler. [ 30 ] The objective of the crawler is to keep the average freshness of pages in its collection as high as possible, or to keep the average age of pages as low as possible. These objectives are not equivalent: in the first case, the crawler is just concerned with how many pages are outdated, while in the second case, the crawler is concerned with how old the local copies of pages are. Evolution of Freshness and Age in a web crawler Two simple re-visiting policies were studied by Cho and Garcia-Molina: [ 31 ] Uniform policy: This involves re-visiting all pages in the collection with the same frequency, regardless of their rates of change. Proportional policy: This involves re-visiting more often the pages that change more frequently. The visiting frequency is directly proportional to the (estimated) change frequency. In both cases, the repeated crawling order of pages can be done either in a random or a fixed order. Cho and Garcia-Molina proved the surprising result that, in terms of average freshness, the uniform policy outperforms the proportional policy in both a simulated Web and a real Web crawl. Intuitively, the reasoning is that, as web crawlers have a limit to how many pages they can crawl in a given time frame, (1) they will allocate too many new crawls to rapidly changing pages at the expense of less frequently updating pages, and (2) the freshness of rapidly changing pages lasts for shorter period than that of less frequently changing pages. In other words, a proportional policy allocates more resources to crawling frequently updating pages, but experiences less overall freshness time from them. To improve freshness, the crawler should penalize the elements that change too often. [ 32 ] The optimal re-visiting policy is neither the uniform policy nor the proportional policy. The optimal method for keeping average freshness high includes ignoring the pages that change too often, and the optimal for keeping average age low is to use access frequencies that monotonically (and sub-linearly) increase with the rate of change of each page. In both cases, the optimal is closer to the uniform policy than to the proportional policy: as Coffman et al. note, \"in order to minimize the expected obsolescence time, the accesses to any particular page should be kept as evenly spaced as possible\". [ 30 ] Explicit formulas for the re-visit policy are not attainable in general, but they are obtained numerically, as they depend on the distribution of page changes. Cho and Garcia-Molina show that the exponential distribution is a good fit for describing page changes, [ 32 ] while Ipeirotis et al. show how to use statistical tools to discover parameters that affect this distribution. [ 33 ] The re-visiting policies considered here regard all pages as homogeneous in terms of quality (\"all pages on the Web are worth the same\"), something that is not a realistic scenario, so further information about the Web page quality should be included to achieve a better crawling policy. Politeness policy [ edit ] Crawlers can retrieve data much quicker and in greater depth than human searchers, so they can have a crippling impact on the performance of a site. If a single crawler is performing multiple requests per second and/or downloading large files, a server can have a hard time keeping up with requests from multiple crawlers. As noted by Koster, the use of Web crawlers is useful for a number of tasks, but comes with a price for the general community. [ 34 ] The costs of using Web crawlers include: network resources, as crawlers require considerable bandwidth and operate with a high degree of parallelism during a long period of time; server overload, especially if the frequency of accesses to a given server is too high; poorly written crawlers, which can crash servers or routers, or which download pages they cannot handle; and personal crawlers that, if deployed by too many users, can disrupt networks and Web servers. A partial solution to these problems is the robots exclusion protocol , also known as the robots.txt protocol that is a standard for administrators to indicate which parts of their Web servers should not be accessed by crawlers. [ 35 ] This standard does not include a suggestion for the interval of visits to the same server, even though this interval is the most effective way of avoiding server overload. Recently commercial search engines like Google , Ask Jeeves , MSN and Yahoo! Search are able to use an extra \"Crawl-delay:\" parameter in the robots.txt file to indicate the number of seconds to delay between requests. The first proposed interval between successive pageloads was 60 seconds. [ 36 ] However, if pages were downloaded at this rate from a website with more than 100,000 pages over a perfect connection with zero latency and infinite bandwidth, it would take more than 2 months to download only that entire Web site; also, only a fraction of the resources from that Web server would be used. Cho uses 10 seconds as an interval for accesses, [ 31 ] and the WIRE crawler uses 15 seconds as the default. [ 37 ] The MercatorWeb crawler follows an adaptive politeness policy: if it took t seconds to download a document from a given server, the crawler waits for 10 t seconds before downloading the next page. [ 38 ] Dill et al. use 1 second. [ 39 ] For those using Web crawlers for research purposes, a more detailed cost-benefit analysis is needed and ethical considerations should be taken into account when deciding where to crawl and how fast to crawl. [ 40 ] Anecdotal evidence from access logs shows that access intervals from known crawlers vary between 20 seconds and 3–4 minutes. It is worth noticing that even when being very polite, and taking all the safeguards to avoid overloading Web servers, some complaints from Web server administrators are received. Sergey Brin and Larry Page noted in 1998, \"... running a crawler which connects to more than half a million servers ... generates a fair amount of e-mail and phone calls. Because of the vast number of people coming on line, there are always those who do not know what a crawler is, because this is the first one they have seen.\" [ 41 ] Parallelization policy [ edit ] Main article: Distributed web crawling A parallel crawler is a crawler that runs multiple processes in parallel. The goal is to maximize the download rate while minimizing the overhead from parallelization and to avoid repeated downloads of the same page. To avoid downloading the same page more than once, the crawling system requires a policy for assigning the new URLs discovered during the crawling process, as the same URL can be found by two different crawling processes. Architectures [ edit ] High-level architecture of a standard Web crawler A crawler must not only have a good crawling strategy, as noted in the previous sections, but it should also have a highly optimized architecture. Shkapenyuk and Suel noted that: [ 42 ] While it is fairly easy to build a slow crawler that downloads a few pages per second for a short period of time, building a high-performance system that can download hundreds of millions of pages over several weeks presents a number of challenges in system design, I/O and network efficiency, and robustness and manageability. Web crawlers are a central part of search engines, and details on their algorithms and architecture are kept as business secrets. When crawler designs are published, there is often an important lack of detail that prevents others from reproducing the work. There are also emerging concerns about \" search engine spamming \", which prevent major search engines from publishing their ranking algorithms. Security [ edit ] While most of the website owners are keen to have their pages indexed as broadly as possible to have strong presence in search engines , web crawling can also have unintended consequences and lead to a compromise or data breach if a search engine indexes resources that should not be publicly available, or pages revealing potentially vulnerable versions of software. Main article: Google hacking Apart from standard web application security recommendations website owners can reduce their exposure to opportunistic hacking by only allowing search engines to index the public parts of their websites (with robots.txt ) and explicitly blocking them from indexing transactional parts (login pages, private pages, etc.). Crawler identification [ edit ] Web crawlers typically identify themselves to a Web server by using the User-agent field of an HTTP request. Web site administrators typically examine their Web servers ' log and use the user agent field to determine which crawlers have visited the web server and how often. The user agent field may include a URL where the Web site administrator may find out more information about the crawler. Examining Web server log is tedious task, and therefore some administrators use tools to identify, track and verify Web crawlers. Spambots and other malicious Web crawlers are unlikely to place identifying information in the user agent field, or they may mask their identity as a browser or other well-known crawler. Web site administrators prefer Web crawlers to identify themselves so that they can contact the owner if needed. In some cases, crawlers may be accidentally trapped in a crawler trap or they may be overloading a Web server with requests, and the owner needs to stop the crawler. Identification is also useful for administrators that are interested in knowing when they may expect their Web pages to be indexed by a particular search engine . Crawling the deep web [ edit ] A vast amount of web pages lie in the deep or invisible web . [ 43 ] These pages are typically only accessible by submitting queries to a database, and regular crawlers are unable to find these pages if there are no links that point to them. Google's Sitemaps protocol and mod oai [ 44 ] are intended to allow discovery of these deep-Web resources. Deep web crawling also multiplies the number of web links to be crawled. Some crawlers only take some of the URLs in <a href=\"URL\"> form. In some cases, such as the Googlebot , Web crawling is done on all text contained inside the hypertext content, tags, or text. Strategic approaches may be taken to target deep Web content. With a technique called screen scraping , specialized software may be customized to automatically and repeatedly query a given Web form with the intention of aggregating the resulting data. Such software can be used to span multiple Web forms across multiple Websites. Data extracted from the results of one Web form submission can be taken and applied as input to another Web form thus establishing continuity across the Deep Web in a way not possible with traditional web crawlers. [ 45 ] Pages built on AJAX are among those causing problems to web crawlers. Google has proposed a format of AJAX calls that their bot can recognize and index. [ 46 ] Visual vs programmatic crawlers [ edit ] There are a number of \"visual web scraper/crawler\" products available on the web which will crawl pages and structure data into columns and rows based on the users requirements. One of the main difference between a classic and a visual crawler is the level of programming ability required to set up a crawler. The latest generation of \"visual scrapers\" remove the majority of the programming skill needed to be able to program and start a crawl to scrape web data. The visual scraping/crawling method relies on the user \"teaching\" a piece of crawler technology, which then follows patterns in semi-structured data sources. The dominant method for teaching a visual crawler is by highlighting data in a browser and training columns and rows. While the technology is not new, for example it was the basis of Needlebase which has been bought by Google (as part of a larger acquisition of ITA Labs [ 47 ] ), there is continued growth and investment in this area by investors and end-users. [ citation needed ] List of web crawlers [ edit ] Further information: List of search engine software The following is a list of published crawler architectures for general-purpose crawlers (excluding focused web crawlers), with a brief description that includes the names given to the different components and outstanding features: Historical web crawlers [ edit ] WolfBot was a massively multi threaded crawler built in 2001 by Mani Singh a Civil Engineering graduate from the University of California at Davis. World Wide Web Worm was a crawler used to build a simple index of document titles and URLs. The index could be searched by using the grep Unix command. Yahoo! Slurp was the name of the Yahoo! Search crawler until Yahoo! contracted with Microsoft to use Bingbot instead. In-house web crawlers [ edit ] Applebot is Apple 's web crawler. It supports Siri and other products. [ 48 ] Bingbot is the name of Microsoft's Bing webcrawler. It replaced Msnbot . Baiduspider is Baidu 's web crawler. DuckDuckBot is DuckDuckGo 's web crawler. Googlebot is described in some detail, but the reference is only about an early version of its architecture, which was written in C++ and Python . The crawler was integrated with the indexing process, because text parsing was done for full-text indexing and also for URL extraction. There is a URL server that sends lists of URLs to be fetched by several crawling processes. During parsing, the URLs found were passed to a URL server that checked if the URL have been previously seen. If not, the URL was added to the queue of the URL server. WebCrawler was used to build the first publicly available full-text index of a subset of the Web. It was based on lib-WWW to download pages, and another program to parse and order URLs for breadth-first exploration of the Web graph. It also included a real-time crawler that followed links based on the similarity of the anchor text with the provided query. WebFountain is a distributed, modular crawler similar to Mercator but written in C++. Xenon is a web crawler used by government tax authorities to detect fraud. [ 49 ] [ 50 ] Commercial web crawlers [ edit ] The following web crawlers are available, for a price:: Diffbot - programmatic general web crawler, available as an API SortSite - crawler for analyzing websites, available for Windows and Mac OS Swiftbot - Swiftype 's web crawler, available as software as a service Aleph Search - web crawler allowing massive collection with high scalability Open-source crawlers [ edit ] Apache Nutch is a highly extensible and scalable web crawler written in Java and released under an Apache License . It is based on Apache Hadoop and can be used with Apache Solr or Elasticsearch . Grub was an open source distributed search crawler that Wikia Search used to crawl the web. Heritrix is the Internet Archive 's archival-quality crawler, designed for archiving periodic snapshots of a large portion of the Web. It was written in Java . ht://Dig includes a Web crawler in its indexing engine. HTTrack uses a Web crawler to create a mirror of a web site for off-line viewing. It is written in C and released under the GPL. Norconex Web Crawler is a highly extensible Web Crawler written in Java and released under an Apache License . It can be used with many repositories such as Apache Solr , Elasticsearch , Microsoft Azure Cognitive Search , Amazon CloudSearch and more. mnoGoSearch is a crawler, indexer and a search engine written in C and licensed under the GPL (*NIX machines only) Open Search Server is a search engine and web crawler software release under the GPL. Scrapy , an open source webcrawler framework, written in python (licensed under BSD ). Seeks , a free distributed search engine (licensed under AGPL ). StormCrawler , a collection of resources for building low-latency, scalable web crawlers on Apache Storm (Apache License). tkWWW Robot , a crawler based on the tkWWW web browser (licensed under GPL). GNU Wget is a command-line -operated crawler written in C and released under the GPL . It is typically used to mirror Web and FTP sites. YaCy , a free distributed search engine, built on principles of peer-to-peer networks (licensed under GPL). See also [ edit ] Automatic indexing Gnutella crawler Web archiving Webgraph Website mirroring software Search Engine Scraping Web scraping References [ edit ] ^ \"Web Crawlers: Browsing the Web\" . Archived from the original on 6 December 2021. ^ Spetka, Scott. \"The TkWWW Robot: Beyond Browsing\" . NCSA . Archived from the original on 3 September 2004 . Retrieved 21 November 2010 . ^ Kobayashi, M. & Takeda, K. (2000). \"Information retrieval on the web\". ACM Computing Surveys . 32 (2): 144– 173. CiteSeerX 10.1.1.126.6094 . doi : 10.1145/358923.358934 . S2CID 3710903 . ^ See definition of scutter on FOAF Project's wiki Archived 13 December 2009 at the Wayback Machine ^ Masanès, Julien (15 February 2007). Web Archiving . Springer. p. 1. ISBN 978-3-54046332-0 . Retrieved 24 April 2014 . ^ Edwards, J.; McCurley, K. S.; and Tomlin, J. A. (2001). \"An adaptive model for optimizing performance of an incremental web crawler\". Proceedings of the 10th international conference on World Wide Web . pp. 106– 113. CiteSeerX 10.1.1.1018.1506 . doi : 10.1145/371920.371960 . ISBN 978-1581133486 . S2CID 10316730 . Archived from the original on 25 June 2014 . Retrieved 25 January 2007 . {{ cite book }} :  CS1 maint: multiple names: authors list ( link ) ^ Castillo, Carlos (2004). Effective Web Crawling (PhD thesis). University of Chile . Retrieved 3 August 2010 . ^ Gulls, A.; A. Signori (2005). \"The indexable web is more than 11.5 billion pages\". Special interest tracks and posters of the 14th international conference on World Wide Web . ACM Press. pp. 902– 903. doi : 10.1145/1062745.1062789 . ^ Lawrence, Steve; C. Lee Giles (8 July 1999). \"Accessibility of information on the web\" . Nature . 400 (6740): 107– 9. Bibcode : 1999Natur.400..107L . doi : 10.1038/21987 . PMID 10428673 . S2CID 4347646 . ^ Cho, J.; Garcia-Molina, H.; Page, L. (April 1998). \"Efficient Crawling Through URL Ordering\" . Seventh International World-Wide Web Conference . Brisbane, Australia. doi : 10.1142/3725 . ISBN 978-981-02-3400-3 . Retrieved 23 March 2009 . ^ Cho, Junghoo, \"Crawling the Web: Discovery and Maintenance of a Large-Scale Web Data\" , PhD dissertation, Department of Computer Science, Stanford University, November 2001. ^ Najork, Marc and Janet L. Wiener. \"Breadth-first crawling yields high-quality pages\". Archived 24 December 2017 at the Wayback Machine In: Proceedings of the Tenth Conference on World Wide Web , pages 114–118, Hong Kong, May 2001. Elsevier Science. ^ Abiteboul, Serge; Mihai Preda; Gregory Cobena (2003). \"Adaptive on-line page importance computation\" . Proceedings of the 12th international conference on World Wide Web . Budapest, Hungary: ACM. pp. 280– 290. doi : 10.1145/775152.775192 . ISBN 1-58113-680-3 . Retrieved 22 March 2009 . ^ Boldi, Paolo; Bruno Codenotti; Massimo Santini; Sebastiano Vigna (2004). \"UbiCrawler: a scalable fully distributed Web crawler\" (PDF) . Software: Practice and Experience . 34 (8): 711– 726. CiteSeerX 10.1.1.2.5538 . doi : 10.1002/spe.587 . S2CID 325714 . Archived from the original (PDF) on 20 March 2009 . Retrieved 23 March 2009 . ^ Boldi, Paolo; Massimo Santini; Sebastiano Vigna (2004). \"Do Your Worst to Make the Best: Paradoxical Effects in PageRank Incremental Computations\" (PDF) . Algorithms and Models for the Web-Graph . Lecture Notes in Computer Science. Vol. 3243. pp. 168– 180. doi : 10.1007/978-3-540-30216-2_14 . ISBN 978-3-540-23427-2 . Archived from the original (PDF) on 1 October 2005 . Retrieved 23 March 2009 . ^ Baeza-Yates, R.; Castillo, C.;  Marin, M. and Rodriguez, A. (2005). \"Crawling a Country: Better Strategies than Breadth-First for Web Page Ordering.\" In: Proceedings of the Industrial and Practical Experience track of the 14th conference on World Wide Web , pages 864–872, Chiba, Japan. ACM Press. ^ Shervin Daneshpajouh, Mojtaba Mohammadi Nasiri, Mohammad Ghodsi, A Fast Community Based Algorithm for Generating Crawler Seeds Set . In: Proceedings of 4th International Conference on Web Information Systems and Technologies ( Webist -2008), Funchal, Portugal, May 2008. ^ Pant, Gautam; Srinivasan, Padmini; Menczer, Filippo (2004). \"Crawling the Web\" (PDF) . In Levene, Mark; Poulovassilis, Alexandra (eds.). Web Dynamics: Adapting to Change in Content, Size, Topology and Use . Springer. pp. 153– 178. ISBN 978-3-540-40676-1 . Archived from the original (PDF) on 20 March 2009 . Retrieved 9 May 2006 . ^ Cothey, Viv (2004). \"Web-crawling reliability\" (PDF) . Journal of the American Society for Information Science and Technology . 55 (14): 1228– 1238. CiteSeerX 10.1.1.117.185 . doi : 10.1002/asi.20078 . ^ Menczer, F. (1997). ARACHNID: Adaptive Retrieval Agents Choosing Heuristic Neighborhoods for Information Discovery Archived 21 December 2012 at the Wayback Machine . In D. Fisher, ed., Machine Learning: Proceedings of the 14th International Conference (ICML97). Morgan Kaufmann ^ Menczer, F. and Belew, R.K. (1998). Adaptive Information Agents in Distributed Textual Environments Archived 21 December 2012 at the Wayback Machine . In K. Sycara and M. Wooldridge (eds.) Proc. 2nd Intl. Conf. on Autonomous Agents (Agents '98). ACM Press ^ Chakrabarti, Soumen; Van Den Berg, Martin; Dom, Byron (1999). \"Focused crawling: A new approach to topic-specific Web resource discovery\" (PDF) . Computer Networks . 31 ( 11– 16): 1623– 1640. doi : 10.1016/s1389-1286(99)00052-3 . Archived from the original (PDF) on 17 March 2004. ^ Pinkerton, B. (1994). Finding what people want: Experiences with the WebCrawler . In Proceedings of the First World Wide Web Conference, Geneva, Switzerland. ^ Diligenti, M., Coetzee, F., Lawrence, S., Giles, C. L., and Gori, M. (2000). Focused crawling using context graphs . In Proceedings of 26th International Conference on Very Large Databases (VLDB), pages 527-534, Cairo, Egypt. ^ Wu, Jian; Teregowda, Pradeep; Khabsa, Madian; Carman, Stephen; Jordan, Douglas; San Pedro Wandelmer, Jose; Lu, Xin; Mitra, Prasenjit; Giles, C. Lee (2012). \"Web crawler middleware for search engine digital libraries\". Proceedings of the twelfth international workshop on Web information and data management - WIDM '12 . p. 57. doi : 10.1145/2389936.2389949 . ISBN 9781450317207 . S2CID 18513666 . ^ Wu, Jian; Teregowda, Pradeep; Ramírez, Juan Pablo Fernández; Mitra, Prasenjit; Zheng, Shuyi; Giles, C. Lee (2012). \"The evolution of a crawling strategy for an academic document search engine\". Proceedings of the 3rd Annual ACM Web Science Conference on - Web Sci '12 . pp. 340– 343. doi : 10.1145/2380718.2380762 . ISBN 9781450312288 . S2CID 16718130 . ^ Dong, Hai; Hussain, Farookh Khadeer; Chang, Elizabeth (2009). \"State of the Art in Semantic Focused Crawlers\" . Computational Science and Its Applications – ICCSA 2009 . Lecture Notes in Computer Science. Vol. 5593. pp. 910– 924. doi : 10.1007/978-3-642-02457-3_74 . hdl : 20.500.11937/48288 . ISBN 978-3-642-02456-6 . ^ Dong, Hai; Hussain, Farookh Khadeer (2013). \"SOF: A semi-supervised ontology-learning-based focused crawler\" . Concurrency and Computation: Practice and Experience . 25 (12): 1755– 1770. doi : 10.1002/cpe.2980 . S2CID 205690364 . ^ Junghoo Cho; Hector Garcia-Molina (2000). \"Synchronizing a database to improve freshness\" (PDF) . Proceedings of the 2000 ACM SIGMOD international conference on Management of data . Dallas, Texas, United States: ACM. pp. 117– 128. doi : 10.1145/342009.335391 . ISBN 1-58113-217-4 . Retrieved 23 March 2009 . ^ a b E. G. Coffman Jr; Zhen Liu; Richard R. Weber (1998). \"Optimal robot scheduling for Web search engines\". Journal of Scheduling . 1 (1): 15– 29. CiteSeerX 10.1.1.36.6087 . doi : 10.1002/(SICI)1099-1425(199806)1:1<15::AID-JOS3>3.0.CO;2-K . ^ a b Cho, Junghoo; Garcia-Molina, Hector (2003). \"Effective page refresh policies for Web crawlers\". ACM Transactions on Database Systems . 28 (4): 390– 426. doi : 10.1145/958942.958945 . S2CID 147958 . ^ a b Junghoo Cho; Hector Garcia-Molina (2003). \"Estimating frequency of change\". ACM Transactions on Internet Technology . 3 (3): 256– 290. CiteSeerX 10.1.1.59.5877 . doi : 10.1145/857166.857170 . S2CID 9362566 . ^ Ipeirotis, P., Ntoulas, A., Cho, J., Gravano, L. (2005) Modeling and managing content changes in text databases Archived 5 September 2005 at the Wayback Machine . In Proceedings of the 21st IEEE International Conference on Data Engineering, pages 606-617, April 2005, Tokyo. ^ Koster, M. (1995). Robots in the web: threat or treat? ConneXions, 9(4). ^ Koster, M. (1996). A standard for robot exclusion Archived 7 November 2007 at the Wayback Machine . ^ Koster, M. (1993). Guidelines for robots writers Archived 22 April 2005 at the Wayback Machine . ^ Baeza-Yates, R. and Castillo, C. (2002). Balancing volume, quality and freshness in Web crawling . In Soft Computing Systems – Design, Management and Applications, pages 565–572, Santiago, Chile. IOS Press Amsterdam. ^ Heydon, Allan; Najork, Marc (26 June 1999). \"Mercator: A Scalable, Extensible Web Crawler\" (PDF) . Archived from the original (PDF) on 19 February 2006 . Retrieved 22 March 2009 . {{ cite journal }} : Cite journal requires |journal= ( help ) ^ Dill, S.; Kumar, R.; Mccurley, K. S.; Rajagopalan, S.; Sivakumar, D.; Tomkins, A. (2002). \"Self-similarity in the web\" (PDF) . ACM Transactions on Internet Technology . 2 (3): 205– 223. doi : 10.1145/572326.572328 . S2CID 6416041 . ^ M. Thelwall; D. Stuart (2006). \"Web crawling ethics revisited: Cost, privacy and denial of service\" . Journal of the American Society for Information Science and Technology . 57 (13): 1771– 1779. doi : 10.1002/asi.20388 . ^ Brin, Sergey; Page, Lawrence (1998). \"The anatomy of a large-scale hypertextual Web search engine\" . Computer Networks and ISDN Systems . 30 ( 1– 7): 107– 117. doi : 10.1016/s0169-7552(98)00110-x . S2CID 7587743 . ^ Shkapenyuk, V. and Suel, T. (2002). Design and implementation of a high performance distributed web crawler . In Proceedings of the 18th International Conference on Data Engineering (ICDE), pages 357-368, San Jose, California. IEEE CS Press. ^ Shestakov, Denis (2008). Search Interfaces on the Web: Querying and Characterizing Archived 6 July 2014 at the Wayback Machine . TUCS Doctoral Dissertations 104, University of Turku ^ Michael L Nelson; Herbert Van de Sompel; Xiaoming Liu; Terry L Harrison; Nathan McFarland (24 March 2005). \"mod_oai: An Apache Module for Metadata Harvesting\": cs/0503069. arXiv : cs/0503069 . Bibcode : 2005cs........3069N . {{ cite journal }} : Cite journal requires |journal= ( help ) ^ Shestakov, Denis; Bhowmick, Sourav S.; Lim, Ee-Peng (2005). \"DEQUE: Querying the Deep Web\" (PDF) . Data & Knowledge Engineering . 52 (3): 273– 311. doi : 10.1016/s0169-023x(04)00107-7 . ^ \"AJAX crawling: Guide for webmasters and developers\" . Retrieved 17 March 2013 . ^ ITA Labs \"ITA Labs Acquisition\" Archived 18 March 2014 at the Wayback Machine 20 April 2011 1:28 AM ^ \"About Applebot\" . Apple Inc . Retrieved 18 October 2021 . ^ Norton, Quinn (25 January 2007). \"Tax takers send in the spiders\" . Business. Wired . Archived from the original on 22 December 2016 . Retrieved 13 October 2017 . ^ \"Xenon web crawling initiative: privacy impact assessment (PIA) summary\" . Ottawa: Government of Canada. 11 April 2017. Archived from the original on 25 September 2017 . Retrieved 13 October 2017 . Further reading [ edit ] Cho, Junghoo, \"Web Crawling Project\" , UCLA Computer Science Department. A History of Search Engines , from Wiley WIVET is a benchmarking project by OWASP , which aims to measure if a web crawler can identify all the hyperlinks in a target website. Shestakov, Denis, \"Current Challenges in Web Crawling\" and \"Intelligent Web Crawling\" , slides for tutorials given at ICWE'13 and WI-IAT'13. v t e Internet search Types Web search engine ( List ) Metasearch engine Multimedia search Collaborative search engine Cross-language search Local search Vertical search Social search Image search Audio search Video search engine Enterprise search Semantic search Natural language search engine Voice search Tools Cross-language information retrieval Search by sound Search engine marketing Search engine optimization Evaluation measures Search oriented architecture Selection-based search Document retrieval Text mining Web crawler Multisearch Federated search Search aggregator Index / Web indexing Focused crawler Spider trap Robots exclusion standard Distributed web crawling Web archiving Website mirroring software Web query Web query classification Protocols and standards Z39.50 Search/Retrieve Web Service Search/Retrieve via URL OpenSearch Representational State Transfer Wide area information server See also Search engine Desktop search Online search v t e Web crawlers Internet bots designed for Web crawling and Web indexing Active 80legs bingbot Crawljax Fetcher Googlebot Heritrix HTTrack PowerMapper Wget Discontinued FAST Crawler msnbot RBSE TkWWW robot Twiceler Types Distributed web crawler Focused crawler Authority control databases : National Germany Retrieved from \" https://en.wikipedia.org/w/index.php?title=Web_crawler&oldid=1287674457 \" Categories : Search engine software Web crawlers Internet search algorithms Hidden categories: Webarchive template wayback links CS1 maint: multiple names: authors list CS1 errors: missing periodical Articles with short description Short description is different from Wikidata Use dmy dates from September 2020 All articles with unsourced statements Articles with unsourced statements from February 2023 Articles with unsourced statements from June 2021 This page was last edited on 27 April 2025, at 18:46 (UTC) . Text is available under the Creative Commons Attribution-ShareAlike 4.0 License ;\nadditional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy . Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc. , a non-profit organization. Privacy policy About Wikipedia Disclaimers Contact Wikipedia Code of Conduct Developers Statistics Cookie statement Mobile view Search Search Toggle the table of contents Web crawler 47 languages Add topic"
    },
    "1": {
        "url": "https://en.wikipedia.org/wiki/Web_crawler#bodyContent",
        "text": "Web crawler - Wikipedia Jump to content Main menu Main menu move to sidebar hide Navigation Main page Contents Current events Random article About Wikipedia Contact us Contribute Help Learn to edit Community portal Recent changes Upload file Special pages Search Search Appearance Donate Create account Log in Personal tools Donate Create account Log in Pages for logged out editors learn more Contributions Talk Contents move to sidebar hide (Top) 1 Nomenclature 2 Overview 3 Crawling policy Toggle Crawling policy subsection 3.1 Selection policy 3.1.1 Restricting followed links 3.1.2 URL normalization 3.1.3 Path-ascending crawling 3.1.4 Focused crawling 3.1.4.1 Academic focused crawler 3.1.4.2 Semantic focused crawler 3.2 Re-visit policy 3.3 Politeness policy 3.4 Parallelization policy 4 Architectures 5 Security 6 Crawler identification 7 Crawling the deep web 8 Visual vs programmatic crawlers 9 List of web crawlers Toggle List of web crawlers subsection 9.1 Historical web crawlers 9.2 In-house web crawlers 9.3 Commercial web crawlers 9.4 Open-source crawlers 10 See also 11 References 12 Further reading Toggle the table of contents Web crawler 47 languages Afrikaans العربية Azərbaycanca Boarisch Català Čeština Cymraeg الدارجة Deutsch Eesti Ελληνικά Español Euskara فارسی Français 한국어 Հայերեն Hrvatski Bahasa Indonesia Interlingua Italiano עברית Latviešu Lietuvių Magyar Bahasa Melayu Nederlands Nedersaksies 日本語 Norsk bokmål Norsk nynorsk Олык марий Polski Português Română Runa Simi Русский Simple English Српски / srpski Suomi Svenska தமிழ் ไทย Türkçe Українська 文言 中文 Edit links Article Talk English Read Edit View history Tools Tools move to sidebar hide Actions Read Edit View history General What links here Related changes Upload file Permanent link Page information Cite this page Get shortened URL Download QR code Print/export Download as PDF Printable version In other projects Wikidata item Appearance move to sidebar hide From Wikipedia, the free encyclopedia Software which systematically browses the World Wide Web This article is about the internet bot. For the search engine, see WebCrawler . \"Web spider\" redirects here and is not to be confused with Spider web . \"Spiderbot\" redirects here. For the video game, see Arac (video game) . Architecture of a Web crawler Web crawler , sometimes called a spider or spiderbot and often shortened to crawler , is an Internet bot that systematically browses the World Wide Web and that is typically operated by search engines for the purpose of Web indexing ( web spidering ). [ 1 ] Web search engines and some other websites use Web crawling or spidering software to update their web content or indices of other sites' web content. Web crawlers copy pages for processing by a search engine, which indexes the downloaded pages so that users can search more efficiently. Crawlers consume resources on visited systems and often visit sites unprompted. Issues of schedule, load, and \"politeness\" come into play when large collections of pages are accessed. Mechanisms exist for public sites not wishing to be crawled to make this known to the crawling agent. For example, including a robots.txt file can request bots to index only parts of a website, or nothing at all. The number of Internet pages is extremely large; even the largest crawlers fall short of making a complete index. For this reason, search engines struggled to give relevant search results in the early years of the World Wide Web, before 2000. Today, relevant results are given almost instantly. Crawlers can validate hyperlinks and HTML code. They can also be used for web scraping and data-driven programming . Nomenclature [ edit ] A web crawler is also known as a spider , [ 2 ] an ant , an automatic indexer , [ 3 ] or (in the FOAF software context) a Web scutter . [ 4 ] Overview [ edit ] A Web crawler starts with a list of URLs to visit. Those first URLs are called the seeds . As the crawler visits these URLs, by communicating with web servers that respond to those URLs, it identifies all the hyperlinks in the retrieved web pages and adds them to the list of URLs to visit, called the crawl frontier . URLs from the frontier are recursively visited according to a set of policies. If the crawler is performing archiving of websites (or web archiving ), it copies and saves the information as it goes. The archives are usually stored in such a way they can be viewed, read and navigated as if they were on the live web, but are preserved as 'snapshots'. [ 5 ] The archive is known as the repository and is designed to store and manage the collection of web pages . The repository only stores HTML pages and these pages are stored as distinct files. A repository is similar to any other system that stores data, like a modern-day database. The only difference is that a repository does not need all the functionality offered by a database system. The repository stores the most recent version of the web page retrieved by the crawler. [ citation needed ] The large volume implies the crawler can only download a limited number of the Web pages within a given time, so it needs to prioritize its downloads. The high rate of change can imply the pages might have already been updated or even deleted. The number of possible URLs crawled being generated by server-side software has also made it difficult for web crawlers to avoid retrieving duplicate content . Endless combinations of HTTP GET (URL-based) parameters exist, of which only a small selection will actually return unique content. For example, a simple online photo gallery may offer three options to users, as specified through HTTP GET parameters in the URL. If there exist four ways to sort images, three choices of thumbnail size, two file formats, and an option to disable user-provided content, then the same set of content can be accessed with 48 different URLs, all of which may be linked on the site. This mathematical combination creates a problem for crawlers, as they must sort through endless combinations of relatively minor scripted changes in order to retrieve unique content. As Edwards et al. noted, \"Given that the bandwidth for conducting crawls is neither infinite nor free, it is becoming essential to crawl the Web in not only a scalable, but efficient way, if some reasonable measure of quality or freshness is to be maintained.\" [ 6 ] A crawler must carefully choose at each step which pages to visit next. Crawling policy [ edit ] The behavior of a Web crawler is the outcome of a combination of policies: [ 7 ] a selection policy which states the pages to download, a re-visit policy which states when to check for changes to the pages, a politeness policy that states how to avoid overloading websites . a parallelization policy that states how to coordinate distributed web crawlers. Selection policy [ edit ] Given the current size of the Web, even large search engines cover only a portion of the publicly available part. A 2009 study showed even large-scale search engines index no more than 40–70% of the indexable Web; [ 8 ] a previous study by Steve Lawrence and Lee Giles showed that no search engine indexed more than 16% of the Web in 1999. [ 9 ] As a crawler always downloads just a fraction of the Web pages , it is highly desirable for the downloaded fraction to contain the most relevant pages and not just a random sample of the Web. This requires a metric of importance for prioritizing Web pages. The importance of a page is a function of its intrinsic quality, its popularity in terms of links or visits, and even of its URL (the latter is the case of vertical search engines restricted to a single top-level domain , or search engines restricted to a fixed Web site). Designing a good selection policy has an added difficulty: it must work with partial information, as the complete set of Web pages is not known during crawling. Junghoo Cho et al. made the first study on policies for crawling scheduling. Their data set was a 180,000-pages crawl from the stanford.edu domain, in which a crawling simulation was done with different strategies. [ 10 ] The ordering metrics tested were breadth-first , backlink count and partial PageRank calculations. One of the conclusions was that if the crawler wants to download pages with high Pagerank early during the crawling process, then the partial Pagerank strategy is the better, followed by breadth-first and backlink-count. However, these results are for just a single domain. Cho also wrote his PhD dissertation at Stanford on web crawling. [ 11 ] Najork and Wiener performed an actual crawl on 328 million pages, using breadth-first ordering. [ 12 ] They found that a breadth-first crawl captures pages with high Pagerank early in the crawl (but they did not compare this strategy against other strategies). The explanation given by the authors for this result is that \"the most important pages have many links to them from numerous hosts, and those links will be found early, regardless of on which host or page the crawl originates.\" Abiteboul designed a crawling strategy based on an algorithm called OPIC (On-line Page Importance Computation). [ 13 ] In OPIC, each page is given an initial sum of \"cash\" that is distributed equally among the pages it points to. It is similar to a PageRank computation, but it is faster and is only done in one step. An OPIC-driven crawler downloads first the pages in the crawling frontier with higher amounts of \"cash\". Experiments were carried in a 100,000-pages synthetic graph with a power-law distribution of in-links. However, there was no comparison with other strategies nor experiments in the real Web. Boldi et al. used simulation on subsets of the Web of 40 million pages from the .it domain and 100 million pages from the WebBase crawl, testing breadth-first against depth-first, random ordering and an omniscient strategy. The comparison was based on how well PageRank computed on a partial crawl approximates the true PageRank value. Some visits that accumulate PageRank very quickly (most notably, breadth-first and the omniscient visit) provide very poor progressive approximations. [ 14 ] [ 15 ] Baeza-Yates et al. used simulation on two subsets of the Web of 3 million pages from the .gr and .cl domain, testing several crawling strategies. [ 16 ] They showed that both the OPIC strategy and a strategy that uses the length of the per-site queues are better than breadth-first crawling, and that it is also very effective to use a previous crawl, when it is available, to guide the current one. Daneshpajouh et al. designed a community based algorithm for discovering good seeds. [ 17 ] Their method crawls web pages with high PageRank from different communities in less iteration in comparison with crawl starting from random seeds. One can extract good seed from a previously-crawled-Web graph using this new method. Using these seeds, a new crawl can be very effective. Restricting followed links [ edit ] A crawler may only want to seek out HTML pages and avoid all other MIME types . In order to request only HTML resources, a crawler may make an HTTP HEAD request to determine a Web resource's MIME type before requesting the entire resource with a GET request. To avoid making numerous HEAD requests, a crawler may examine the URL and only request a resource if the URL ends with certain characters such as .html, .htm, .asp, .aspx, .php, .jsp, .jspx or a slash. This strategy may cause numerous HTML Web resources to be unintentionally skipped. Some crawlers may also avoid requesting any resources that have a \"?\" in them (are dynamically produced) in order to avoid spider traps that may cause the crawler to download an infinite number of URLs from a Web site. This strategy is unreliable if the site uses URL rewriting to simplify its URLs. URL normalization [ edit ] Main article: URL normalization Crawlers usually perform some type of URL normalization in order to avoid crawling the same resource more than once. The term URL normalization , also called URL canonicalization , refers to the process of modifying and standardizing a URL in a consistent manner. There are several types of normalization that may be performed including conversion of URLs to lowercase, removal of \".\" and \"..\" segments, and adding trailing slashes to the non-empty path component. [ 18 ] Path-ascending crawling [ edit ] Some crawlers intend to download/upload as many resources as possible from a particular web site. So path-ascending crawler was introduced that would ascend to every path in each URL that it intends to crawl. [ 19 ] For example, when given a seed URL of http://llama.org/hamster/monkey/page.html, it will attempt to crawl /hamster/monkey/, /hamster/, and /. Cothey found that a path-ascending crawler was very effective in finding isolated resources, or resources for which no inbound link would have been found in regular crawling. Focused crawling [ edit ] Main article: Focused crawler The importance of a page for a crawler can also be expressed as a function of the similarity of a page to a given query. Web crawlers that attempt to download pages that are similar to each other are called focused crawler or topical crawlers . The concepts of topical and focused crawling were first introduced by Filippo Menczer [ 20 ] [ 21 ] and by Soumen Chakrabarti et al. [ 22 ] The main problem in focused crawling is that in the context of a Web crawler, we would like to be able to predict the similarity of the text of a given page to the query before actually downloading the page. A possible predictor is the anchor text of links; this was the approach taken by Pinkerton [ 23 ] in the first web crawler of the early days of the Web. Diligenti et al. [ 24 ] propose using the complete content of the pages already visited to infer the similarity between the driving query and the pages that have not been visited yet. The performance of a focused crawling depends mostly on the richness of links in the specific topic being searched, and a focused crawling usually relies on a general Web search engine for providing starting points. Academic focused crawler [ edit ] An example of the focused crawlers are academic crawlers, which crawls free-access academic related documents, such as the citeseerxbot , which is the crawler of CiteSeer X search engine. Other academic search engines are Google Scholar and Microsoft Academic Search etc. Because most academic papers are published in PDF formats, such kind of crawler is particularly interested in crawling PDF, PostScript files, Microsoft Word including their zipped formats. Because of this, general open-source crawlers, such as Heritrix , must be customized to filter out other MIME types , or a middleware is used to extract these documents out and import them to the focused crawl database and repository. [ 25 ] Identifying whether these documents are academic or not is challenging and can add a significant overhead to the crawling process, so this is performed as a post crawling process using machine learning or regular expression algorithms. These academic documents are usually obtained from home pages of faculties and students or from publication page of research institutes. Because academic documents make up only a small fraction of all web pages, a good seed selection is important in boosting the efficiencies of these web crawlers. [ 26 ] Other academic crawlers may download plain text and HTML files, that contains metadata of academic papers, such as titles, papers, and abstracts. This increases the overall number of papers, but a significant fraction may not provide free PDF downloads. Semantic focused crawler [ edit ] Another type of focused crawlers is semantic focused crawler, which makes use of domain ontologies to represent topical maps and link Web pages with relevant ontological concepts for the selection and categorization purposes. [ 27 ] In addition, ontologies can be automatically updated in the crawling process. Dong et al. [ 28 ] introduced such an ontology-learning-based crawler using a support-vector machine to update the content of ontological concepts when crawling Web pages. Re-visit policy [ edit ] The Web has a very dynamic nature, and crawling a fraction of the Web can take weeks or months. By the time a Web crawler has finished its crawl, many events could have happened, including creations, updates, and deletions. From the search engine's point of view, there is a cost associated with not detecting an event, and thus having an outdated copy of a resource. The most-used cost functions are freshness and age. [ 29 ] Freshness : This is a binary measure that indicates whether the local copy is accurate or not. The freshness of a page p in the repository at time t is defined as: F p ( t ) = { 1 i f p i s e q u a l t o t h e l o c a l c o p y a t t i m e t 0 o t h e r w i s e {\\displaystyle F_{p}(t)={\\begin{cases}1&{\\rm {if}}~p~{\\rm {~is~equal~to~the~local~copy~at~time}}~t\\\\0&{\\rm {otherwise}}\\end{cases}}} Age : This is a measure that indicates how outdated the local copy is. The age of a page p in the repository, at time t is defined as: A p ( t ) = { 0 i f p i s n o t m o d i f i e d a t t i m e t t − m o d i f i c a t i o n t i m e o f p o t h e r w i s e {\\displaystyle A_{p}(t)={\\begin{cases}0&{\\rm {if}}~p~{\\rm {~is~not~modified~at~time}}~t\\\\t-{\\rm {modification~time~of}}~p&{\\rm {otherwise}}\\end{cases}}} Coffman et al. worked with a definition of the objective of a Web crawler that is equivalent to freshness, but use a different wording: they propose that a crawler must minimize the fraction of time pages remain outdated. They also noted that the problem of Web crawling can be modeled as a multiple-queue, single-server polling system, on which the Web crawler is the server and the Web sites are the queues. Page modifications are the arrival of the customers, and switch-over times are the interval between page accesses to a single Web site. Under this model, mean waiting time for a customer in the polling system is equivalent to the average age for the Web crawler. [ 30 ] The objective of the crawler is to keep the average freshness of pages in its collection as high as possible, or to keep the average age of pages as low as possible. These objectives are not equivalent: in the first case, the crawler is just concerned with how many pages are outdated, while in the second case, the crawler is concerned with how old the local copies of pages are. Evolution of Freshness and Age in a web crawler Two simple re-visiting policies were studied by Cho and Garcia-Molina: [ 31 ] Uniform policy: This involves re-visiting all pages in the collection with the same frequency, regardless of their rates of change. Proportional policy: This involves re-visiting more often the pages that change more frequently. The visiting frequency is directly proportional to the (estimated) change frequency. In both cases, the repeated crawling order of pages can be done either in a random or a fixed order. Cho and Garcia-Molina proved the surprising result that, in terms of average freshness, the uniform policy outperforms the proportional policy in both a simulated Web and a real Web crawl. Intuitively, the reasoning is that, as web crawlers have a limit to how many pages they can crawl in a given time frame, (1) they will allocate too many new crawls to rapidly changing pages at the expense of less frequently updating pages, and (2) the freshness of rapidly changing pages lasts for shorter period than that of less frequently changing pages. In other words, a proportional policy allocates more resources to crawling frequently updating pages, but experiences less overall freshness time from them. To improve freshness, the crawler should penalize the elements that change too often. [ 32 ] The optimal re-visiting policy is neither the uniform policy nor the proportional policy. The optimal method for keeping average freshness high includes ignoring the pages that change too often, and the optimal for keeping average age low is to use access frequencies that monotonically (and sub-linearly) increase with the rate of change of each page. In both cases, the optimal is closer to the uniform policy than to the proportional policy: as Coffman et al. note, \"in order to minimize the expected obsolescence time, the accesses to any particular page should be kept as evenly spaced as possible\". [ 30 ] Explicit formulas for the re-visit policy are not attainable in general, but they are obtained numerically, as they depend on the distribution of page changes. Cho and Garcia-Molina show that the exponential distribution is a good fit for describing page changes, [ 32 ] while Ipeirotis et al. show how to use statistical tools to discover parameters that affect this distribution. [ 33 ] The re-visiting policies considered here regard all pages as homogeneous in terms of quality (\"all pages on the Web are worth the same\"), something that is not a realistic scenario, so further information about the Web page quality should be included to achieve a better crawling policy. Politeness policy [ edit ] Crawlers can retrieve data much quicker and in greater depth than human searchers, so they can have a crippling impact on the performance of a site. If a single crawler is performing multiple requests per second and/or downloading large files, a server can have a hard time keeping up with requests from multiple crawlers. As noted by Koster, the use of Web crawlers is useful for a number of tasks, but comes with a price for the general community. [ 34 ] The costs of using Web crawlers include: network resources, as crawlers require considerable bandwidth and operate with a high degree of parallelism during a long period of time; server overload, especially if the frequency of accesses to a given server is too high; poorly written crawlers, which can crash servers or routers, or which download pages they cannot handle; and personal crawlers that, if deployed by too many users, can disrupt networks and Web servers. A partial solution to these problems is the robots exclusion protocol , also known as the robots.txt protocol that is a standard for administrators to indicate which parts of their Web servers should not be accessed by crawlers. [ 35 ] This standard does not include a suggestion for the interval of visits to the same server, even though this interval is the most effective way of avoiding server overload. Recently commercial search engines like Google , Ask Jeeves , MSN and Yahoo! Search are able to use an extra \"Crawl-delay:\" parameter in the robots.txt file to indicate the number of seconds to delay between requests. The first proposed interval between successive pageloads was 60 seconds. [ 36 ] However, if pages were downloaded at this rate from a website with more than 100,000 pages over a perfect connection with zero latency and infinite bandwidth, it would take more than 2 months to download only that entire Web site; also, only a fraction of the resources from that Web server would be used. Cho uses 10 seconds as an interval for accesses, [ 31 ] and the WIRE crawler uses 15 seconds as the default. [ 37 ] The MercatorWeb crawler follows an adaptive politeness policy: if it took t seconds to download a document from a given server, the crawler waits for 10 t seconds before downloading the next page. [ 38 ] Dill et al. use 1 second. [ 39 ] For those using Web crawlers for research purposes, a more detailed cost-benefit analysis is needed and ethical considerations should be taken into account when deciding where to crawl and how fast to crawl. [ 40 ] Anecdotal evidence from access logs shows that access intervals from known crawlers vary between 20 seconds and 3–4 minutes. It is worth noticing that even when being very polite, and taking all the safeguards to avoid overloading Web servers, some complaints from Web server administrators are received. Sergey Brin and Larry Page noted in 1998, \"... running a crawler which connects to more than half a million servers ... generates a fair amount of e-mail and phone calls. Because of the vast number of people coming on line, there are always those who do not know what a crawler is, because this is the first one they have seen.\" [ 41 ] Parallelization policy [ edit ] Main article: Distributed web crawling A parallel crawler is a crawler that runs multiple processes in parallel. The goal is to maximize the download rate while minimizing the overhead from parallelization and to avoid repeated downloads of the same page. To avoid downloading the same page more than once, the crawling system requires a policy for assigning the new URLs discovered during the crawling process, as the same URL can be found by two different crawling processes. Architectures [ edit ] High-level architecture of a standard Web crawler A crawler must not only have a good crawling strategy, as noted in the previous sections, but it should also have a highly optimized architecture. Shkapenyuk and Suel noted that: [ 42 ] While it is fairly easy to build a slow crawler that downloads a few pages per second for a short period of time, building a high-performance system that can download hundreds of millions of pages over several weeks presents a number of challenges in system design, I/O and network efficiency, and robustness and manageability. Web crawlers are a central part of search engines, and details on their algorithms and architecture are kept as business secrets. When crawler designs are published, there is often an important lack of detail that prevents others from reproducing the work. There are also emerging concerns about \" search engine spamming \", which prevent major search engines from publishing their ranking algorithms. Security [ edit ] While most of the website owners are keen to have their pages indexed as broadly as possible to have strong presence in search engines , web crawling can also have unintended consequences and lead to a compromise or data breach if a search engine indexes resources that should not be publicly available, or pages revealing potentially vulnerable versions of software. Main article: Google hacking Apart from standard web application security recommendations website owners can reduce their exposure to opportunistic hacking by only allowing search engines to index the public parts of their websites (with robots.txt ) and explicitly blocking them from indexing transactional parts (login pages, private pages, etc.). Crawler identification [ edit ] Web crawlers typically identify themselves to a Web server by using the User-agent field of an HTTP request. Web site administrators typically examine their Web servers ' log and use the user agent field to determine which crawlers have visited the web server and how often. The user agent field may include a URL where the Web site administrator may find out more information about the crawler. Examining Web server log is tedious task, and therefore some administrators use tools to identify, track and verify Web crawlers. Spambots and other malicious Web crawlers are unlikely to place identifying information in the user agent field, or they may mask their identity as a browser or other well-known crawler. Web site administrators prefer Web crawlers to identify themselves so that they can contact the owner if needed. In some cases, crawlers may be accidentally trapped in a crawler trap or they may be overloading a Web server with requests, and the owner needs to stop the crawler. Identification is also useful for administrators that are interested in knowing when they may expect their Web pages to be indexed by a particular search engine . Crawling the deep web [ edit ] A vast amount of web pages lie in the deep or invisible web . [ 43 ] These pages are typically only accessible by submitting queries to a database, and regular crawlers are unable to find these pages if there are no links that point to them. Google's Sitemaps protocol and mod oai [ 44 ] are intended to allow discovery of these deep-Web resources. Deep web crawling also multiplies the number of web links to be crawled. Some crawlers only take some of the URLs in <a href=\"URL\"> form. In some cases, such as the Googlebot , Web crawling is done on all text contained inside the hypertext content, tags, or text. Strategic approaches may be taken to target deep Web content. With a technique called screen scraping , specialized software may be customized to automatically and repeatedly query a given Web form with the intention of aggregating the resulting data. Such software can be used to span multiple Web forms across multiple Websites. Data extracted from the results of one Web form submission can be taken and applied as input to another Web form thus establishing continuity across the Deep Web in a way not possible with traditional web crawlers. [ 45 ] Pages built on AJAX are among those causing problems to web crawlers. Google has proposed a format of AJAX calls that their bot can recognize and index. [ 46 ] Visual vs programmatic crawlers [ edit ] There are a number of \"visual web scraper/crawler\" products available on the web which will crawl pages and structure data into columns and rows based on the users requirements. One of the main difference between a classic and a visual crawler is the level of programming ability required to set up a crawler. The latest generation of \"visual scrapers\" remove the majority of the programming skill needed to be able to program and start a crawl to scrape web data. The visual scraping/crawling method relies on the user \"teaching\" a piece of crawler technology, which then follows patterns in semi-structured data sources. The dominant method for teaching a visual crawler is by highlighting data in a browser and training columns and rows. While the technology is not new, for example it was the basis of Needlebase which has been bought by Google (as part of a larger acquisition of ITA Labs [ 47 ] ), there is continued growth and investment in this area by investors and end-users. [ citation needed ] List of web crawlers [ edit ] Further information: List of search engine software The following is a list of published crawler architectures for general-purpose crawlers (excluding focused web crawlers), with a brief description that includes the names given to the different components and outstanding features: Historical web crawlers [ edit ] WolfBot was a massively multi threaded crawler built in 2001 by Mani Singh a Civil Engineering graduate from the University of California at Davis. World Wide Web Worm was a crawler used to build a simple index of document titles and URLs. The index could be searched by using the grep Unix command. Yahoo! Slurp was the name of the Yahoo! Search crawler until Yahoo! contracted with Microsoft to use Bingbot instead. In-house web crawlers [ edit ] Applebot is Apple 's web crawler. It supports Siri and other products. [ 48 ] Bingbot is the name of Microsoft's Bing webcrawler. It replaced Msnbot . Baiduspider is Baidu 's web crawler. DuckDuckBot is DuckDuckGo 's web crawler. Googlebot is described in some detail, but the reference is only about an early version of its architecture, which was written in C++ and Python . The crawler was integrated with the indexing process, because text parsing was done for full-text indexing and also for URL extraction. There is a URL server that sends lists of URLs to be fetched by several crawling processes. During parsing, the URLs found were passed to a URL server that checked if the URL have been previously seen. If not, the URL was added to the queue of the URL server. WebCrawler was used to build the first publicly available full-text index of a subset of the Web. It was based on lib-WWW to download pages, and another program to parse and order URLs for breadth-first exploration of the Web graph. It also included a real-time crawler that followed links based on the similarity of the anchor text with the provided query. WebFountain is a distributed, modular crawler similar to Mercator but written in C++. Xenon is a web crawler used by government tax authorities to detect fraud. [ 49 ] [ 50 ] Commercial web crawlers [ edit ] The following web crawlers are available, for a price:: Diffbot - programmatic general web crawler, available as an API SortSite - crawler for analyzing websites, available for Windows and Mac OS Swiftbot - Swiftype 's web crawler, available as software as a service Aleph Search - web crawler allowing massive collection with high scalability Open-source crawlers [ edit ] Apache Nutch is a highly extensible and scalable web crawler written in Java and released under an Apache License . It is based on Apache Hadoop and can be used with Apache Solr or Elasticsearch . Grub was an open source distributed search crawler that Wikia Search used to crawl the web. Heritrix is the Internet Archive 's archival-quality crawler, designed for archiving periodic snapshots of a large portion of the Web. It was written in Java . ht://Dig includes a Web crawler in its indexing engine. HTTrack uses a Web crawler to create a mirror of a web site for off-line viewing. It is written in C and released under the GPL. Norconex Web Crawler is a highly extensible Web Crawler written in Java and released under an Apache License . It can be used with many repositories such as Apache Solr , Elasticsearch , Microsoft Azure Cognitive Search , Amazon CloudSearch and more. mnoGoSearch is a crawler, indexer and a search engine written in C and licensed under the GPL (*NIX machines only) Open Search Server is a search engine and web crawler software release under the GPL. Scrapy , an open source webcrawler framework, written in python (licensed under BSD ). Seeks , a free distributed search engine (licensed under AGPL ). StormCrawler , a collection of resources for building low-latency, scalable web crawlers on Apache Storm (Apache License). tkWWW Robot , a crawler based on the tkWWW web browser (licensed under GPL). GNU Wget is a command-line -operated crawler written in C and released under the GPL . It is typically used to mirror Web and FTP sites. YaCy , a free distributed search engine, built on principles of peer-to-peer networks (licensed under GPL). See also [ edit ] Automatic indexing Gnutella crawler Web archiving Webgraph Website mirroring software Search Engine Scraping Web scraping References [ edit ] ^ \"Web Crawlers: Browsing the Web\" . Archived from the original on 6 December 2021. ^ Spetka, Scott. \"The TkWWW Robot: Beyond Browsing\" . NCSA . Archived from the original on 3 September 2004 . Retrieved 21 November 2010 . ^ Kobayashi, M. & Takeda, K. (2000). \"Information retrieval on the web\". ACM Computing Surveys . 32 (2): 144– 173. CiteSeerX 10.1.1.126.6094 . doi : 10.1145/358923.358934 . S2CID 3710903 . ^ See definition of scutter on FOAF Project's wiki Archived 13 December 2009 at the Wayback Machine ^ Masanès, Julien (15 February 2007). Web Archiving . Springer. p. 1. ISBN 978-3-54046332-0 . Retrieved 24 April 2014 . ^ Edwards, J.; McCurley, K. S.; and Tomlin, J. A. (2001). \"An adaptive model for optimizing performance of an incremental web crawler\". Proceedings of the 10th international conference on World Wide Web . pp. 106– 113. CiteSeerX 10.1.1.1018.1506 . doi : 10.1145/371920.371960 . ISBN 978-1581133486 . S2CID 10316730 . Archived from the original on 25 June 2014 . Retrieved 25 January 2007 . {{ cite book }} :  CS1 maint: multiple names: authors list ( link ) ^ Castillo, Carlos (2004). Effective Web Crawling (PhD thesis). University of Chile . Retrieved 3 August 2010 . ^ Gulls, A.; A. Signori (2005). \"The indexable web is more than 11.5 billion pages\". Special interest tracks and posters of the 14th international conference on World Wide Web . ACM Press. pp. 902– 903. doi : 10.1145/1062745.1062789 . ^ Lawrence, Steve; C. Lee Giles (8 July 1999). \"Accessibility of information on the web\" . Nature . 400 (6740): 107– 9. Bibcode : 1999Natur.400..107L . doi : 10.1038/21987 . PMID 10428673 . S2CID 4347646 . ^ Cho, J.; Garcia-Molina, H.; Page, L. (April 1998). \"Efficient Crawling Through URL Ordering\" . Seventh International World-Wide Web Conference . Brisbane, Australia. doi : 10.1142/3725 . ISBN 978-981-02-3400-3 . Retrieved 23 March 2009 . ^ Cho, Junghoo, \"Crawling the Web: Discovery and Maintenance of a Large-Scale Web Data\" , PhD dissertation, Department of Computer Science, Stanford University, November 2001. ^ Najork, Marc and Janet L. Wiener. \"Breadth-first crawling yields high-quality pages\". Archived 24 December 2017 at the Wayback Machine In: Proceedings of the Tenth Conference on World Wide Web , pages 114–118, Hong Kong, May 2001. Elsevier Science. ^ Abiteboul, Serge; Mihai Preda; Gregory Cobena (2003). \"Adaptive on-line page importance computation\" . Proceedings of the 12th international conference on World Wide Web . Budapest, Hungary: ACM. pp. 280– 290. doi : 10.1145/775152.775192 . ISBN 1-58113-680-3 . Retrieved 22 March 2009 . ^ Boldi, Paolo; Bruno Codenotti; Massimo Santini; Sebastiano Vigna (2004). \"UbiCrawler: a scalable fully distributed Web crawler\" (PDF) . Software: Practice and Experience . 34 (8): 711– 726. CiteSeerX 10.1.1.2.5538 . doi : 10.1002/spe.587 . S2CID 325714 . Archived from the original (PDF) on 20 March 2009 . Retrieved 23 March 2009 . ^ Boldi, Paolo; Massimo Santini; Sebastiano Vigna (2004). \"Do Your Worst to Make the Best: Paradoxical Effects in PageRank Incremental Computations\" (PDF) . Algorithms and Models for the Web-Graph . Lecture Notes in Computer Science. Vol. 3243. pp. 168– 180. doi : 10.1007/978-3-540-30216-2_14 . ISBN 978-3-540-23427-2 . Archived from the original (PDF) on 1 October 2005 . Retrieved 23 March 2009 . ^ Baeza-Yates, R.; Castillo, C.;  Marin, M. and Rodriguez, A. (2005). \"Crawling a Country: Better Strategies than Breadth-First for Web Page Ordering.\" In: Proceedings of the Industrial and Practical Experience track of the 14th conference on World Wide Web , pages 864–872, Chiba, Japan. ACM Press. ^ Shervin Daneshpajouh, Mojtaba Mohammadi Nasiri, Mohammad Ghodsi, A Fast Community Based Algorithm for Generating Crawler Seeds Set . In: Proceedings of 4th International Conference on Web Information Systems and Technologies ( Webist -2008), Funchal, Portugal, May 2008. ^ Pant, Gautam; Srinivasan, Padmini; Menczer, Filippo (2004). \"Crawling the Web\" (PDF) . In Levene, Mark; Poulovassilis, Alexandra (eds.). Web Dynamics: Adapting to Change in Content, Size, Topology and Use . Springer. pp. 153– 178. ISBN 978-3-540-40676-1 . Archived from the original (PDF) on 20 March 2009 . Retrieved 9 May 2006 . ^ Cothey, Viv (2004). \"Web-crawling reliability\" (PDF) . Journal of the American Society for Information Science and Technology . 55 (14): 1228– 1238. CiteSeerX 10.1.1.117.185 . doi : 10.1002/asi.20078 . ^ Menczer, F. (1997). ARACHNID: Adaptive Retrieval Agents Choosing Heuristic Neighborhoods for Information Discovery Archived 21 December 2012 at the Wayback Machine . In D. Fisher, ed., Machine Learning: Proceedings of the 14th International Conference (ICML97). Morgan Kaufmann ^ Menczer, F. and Belew, R.K. (1998). Adaptive Information Agents in Distributed Textual Environments Archived 21 December 2012 at the Wayback Machine . In K. Sycara and M. Wooldridge (eds.) Proc. 2nd Intl. Conf. on Autonomous Agents (Agents '98). ACM Press ^ Chakrabarti, Soumen; Van Den Berg, Martin; Dom, Byron (1999). \"Focused crawling: A new approach to topic-specific Web resource discovery\" (PDF) . Computer Networks . 31 ( 11– 16): 1623– 1640. doi : 10.1016/s1389-1286(99)00052-3 . Archived from the original (PDF) on 17 March 2004. ^ Pinkerton, B. (1994). Finding what people want: Experiences with the WebCrawler . In Proceedings of the First World Wide Web Conference, Geneva, Switzerland. ^ Diligenti, M., Coetzee, F., Lawrence, S., Giles, C. L., and Gori, M. (2000). Focused crawling using context graphs . In Proceedings of 26th International Conference on Very Large Databases (VLDB), pages 527-534, Cairo, Egypt. ^ Wu, Jian; Teregowda, Pradeep; Khabsa, Madian; Carman, Stephen; Jordan, Douglas; San Pedro Wandelmer, Jose; Lu, Xin; Mitra, Prasenjit; Giles, C. Lee (2012). \"Web crawler middleware for search engine digital libraries\". Proceedings of the twelfth international workshop on Web information and data management - WIDM '12 . p. 57. doi : 10.1145/2389936.2389949 . ISBN 9781450317207 . S2CID 18513666 . ^ Wu, Jian; Teregowda, Pradeep; Ramírez, Juan Pablo Fernández; Mitra, Prasenjit; Zheng, Shuyi; Giles, C. Lee (2012). \"The evolution of a crawling strategy for an academic document search engine\". Proceedings of the 3rd Annual ACM Web Science Conference on - Web Sci '12 . pp. 340– 343. doi : 10.1145/2380718.2380762 . ISBN 9781450312288 . S2CID 16718130 . ^ Dong, Hai; Hussain, Farookh Khadeer; Chang, Elizabeth (2009). \"State of the Art in Semantic Focused Crawlers\" . Computational Science and Its Applications – ICCSA 2009 . Lecture Notes in Computer Science. Vol. 5593. pp. 910– 924. doi : 10.1007/978-3-642-02457-3_74 . hdl : 20.500.11937/48288 . ISBN 978-3-642-02456-6 . ^ Dong, Hai; Hussain, Farookh Khadeer (2013). \"SOF: A semi-supervised ontology-learning-based focused crawler\" . Concurrency and Computation: Practice and Experience . 25 (12): 1755– 1770. doi : 10.1002/cpe.2980 . S2CID 205690364 . ^ Junghoo Cho; Hector Garcia-Molina (2000). \"Synchronizing a database to improve freshness\" (PDF) . Proceedings of the 2000 ACM SIGMOD international conference on Management of data . Dallas, Texas, United States: ACM. pp. 117– 128. doi : 10.1145/342009.335391 . ISBN 1-58113-217-4 . Retrieved 23 March 2009 . ^ a b E. G. Coffman Jr; Zhen Liu; Richard R. Weber (1998). \"Optimal robot scheduling for Web search engines\". Journal of Scheduling . 1 (1): 15– 29. CiteSeerX 10.1.1.36.6087 . doi : 10.1002/(SICI)1099-1425(199806)1:1<15::AID-JOS3>3.0.CO;2-K . ^ a b Cho, Junghoo; Garcia-Molina, Hector (2003). \"Effective page refresh policies for Web crawlers\". ACM Transactions on Database Systems . 28 (4): 390– 426. doi : 10.1145/958942.958945 . S2CID 147958 . ^ a b Junghoo Cho; Hector Garcia-Molina (2003). \"Estimating frequency of change\". ACM Transactions on Internet Technology . 3 (3): 256– 290. CiteSeerX 10.1.1.59.5877 . doi : 10.1145/857166.857170 . S2CID 9362566 . ^ Ipeirotis, P., Ntoulas, A., Cho, J., Gravano, L. (2005) Modeling and managing content changes in text databases Archived 5 September 2005 at the Wayback Machine . In Proceedings of the 21st IEEE International Conference on Data Engineering, pages 606-617, April 2005, Tokyo. ^ Koster, M. (1995). Robots in the web: threat or treat? ConneXions, 9(4). ^ Koster, M. (1996). A standard for robot exclusion Archived 7 November 2007 at the Wayback Machine . ^ Koster, M. (1993). Guidelines for robots writers Archived 22 April 2005 at the Wayback Machine . ^ Baeza-Yates, R. and Castillo, C. (2002). Balancing volume, quality and freshness in Web crawling . In Soft Computing Systems – Design, Management and Applications, pages 565–572, Santiago, Chile. IOS Press Amsterdam. ^ Heydon, Allan; Najork, Marc (26 June 1999). \"Mercator: A Scalable, Extensible Web Crawler\" (PDF) . Archived from the original (PDF) on 19 February 2006 . Retrieved 22 March 2009 . {{ cite journal }} : Cite journal requires |journal= ( help ) ^ Dill, S.; Kumar, R.; Mccurley, K. S.; Rajagopalan, S.; Sivakumar, D.; Tomkins, A. (2002). \"Self-similarity in the web\" (PDF) . ACM Transactions on Internet Technology . 2 (3): 205– 223. doi : 10.1145/572326.572328 . S2CID 6416041 . ^ M. Thelwall; D. Stuart (2006). \"Web crawling ethics revisited: Cost, privacy and denial of service\" . Journal of the American Society for Information Science and Technology . 57 (13): 1771– 1779. doi : 10.1002/asi.20388 . ^ Brin, Sergey; Page, Lawrence (1998). \"The anatomy of a large-scale hypertextual Web search engine\" . Computer Networks and ISDN Systems . 30 ( 1– 7): 107– 117. doi : 10.1016/s0169-7552(98)00110-x . S2CID 7587743 . ^ Shkapenyuk, V. and Suel, T. (2002). Design and implementation of a high performance distributed web crawler . In Proceedings of the 18th International Conference on Data Engineering (ICDE), pages 357-368, San Jose, California. IEEE CS Press. ^ Shestakov, Denis (2008). Search Interfaces on the Web: Querying and Characterizing Archived 6 July 2014 at the Wayback Machine . TUCS Doctoral Dissertations 104, University of Turku ^ Michael L Nelson; Herbert Van de Sompel; Xiaoming Liu; Terry L Harrison; Nathan McFarland (24 March 2005). \"mod_oai: An Apache Module for Metadata Harvesting\": cs/0503069. arXiv : cs/0503069 . Bibcode : 2005cs........3069N . {{ cite journal }} : Cite journal requires |journal= ( help ) ^ Shestakov, Denis; Bhowmick, Sourav S.; Lim, Ee-Peng (2005). \"DEQUE: Querying the Deep Web\" (PDF) . Data & Knowledge Engineering . 52 (3): 273– 311. doi : 10.1016/s0169-023x(04)00107-7 . ^ \"AJAX crawling: Guide for webmasters and developers\" . Retrieved 17 March 2013 . ^ ITA Labs \"ITA Labs Acquisition\" Archived 18 March 2014 at the Wayback Machine 20 April 2011 1:28 AM ^ \"About Applebot\" . Apple Inc . Retrieved 18 October 2021 . ^ Norton, Quinn (25 January 2007). \"Tax takers send in the spiders\" . Business. Wired . Archived from the original on 22 December 2016 . Retrieved 13 October 2017 . ^ \"Xenon web crawling initiative: privacy impact assessment (PIA) summary\" . Ottawa: Government of Canada. 11 April 2017. Archived from the original on 25 September 2017 . Retrieved 13 October 2017 . Further reading [ edit ] Cho, Junghoo, \"Web Crawling Project\" , UCLA Computer Science Department. A History of Search Engines , from Wiley WIVET is a benchmarking project by OWASP , which aims to measure if a web crawler can identify all the hyperlinks in a target website. Shestakov, Denis, \"Current Challenges in Web Crawling\" and \"Intelligent Web Crawling\" , slides for tutorials given at ICWE'13 and WI-IAT'13. v t e Internet search Types Web search engine ( List ) Metasearch engine Multimedia search Collaborative search engine Cross-language search Local search Vertical search Social search Image search Audio search Video search engine Enterprise search Semantic search Natural language search engine Voice search Tools Cross-language information retrieval Search by sound Search engine marketing Search engine optimization Evaluation measures Search oriented architecture Selection-based search Document retrieval Text mining Web crawler Multisearch Federated search Search aggregator Index / Web indexing Focused crawler Spider trap Robots exclusion standard Distributed web crawling Web archiving Website mirroring software Web query Web query classification Protocols and standards Z39.50 Search/Retrieve Web Service Search/Retrieve via URL OpenSearch Representational State Transfer Wide area information server See also Search engine Desktop search Online search v t e Web crawlers Internet bots designed for Web crawling and Web indexing Active 80legs bingbot Crawljax Fetcher Googlebot Heritrix HTTrack PowerMapper Wget Discontinued FAST Crawler msnbot RBSE TkWWW robot Twiceler Types Distributed web crawler Focused crawler Authority control databases : National Germany Retrieved from \" https://en.wikipedia.org/w/index.php?title=Web_crawler&oldid=1287674457 \" Categories : Search engine software Web crawlers Internet search algorithms Hidden categories: Webarchive template wayback links CS1 maint: multiple names: authors list CS1 errors: missing periodical Articles with short description Short description is different from Wikidata Use dmy dates from September 2020 All articles with unsourced statements Articles with unsourced statements from February 2023 Articles with unsourced statements from June 2021 This page was last edited on 27 April 2025, at 18:46 (UTC) . Text is available under the Creative Commons Attribution-ShareAlike 4.0 License ;\nadditional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy . Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc. , a non-profit organization. Privacy policy About Wikipedia Disclaimers Contact Wikipedia Code of Conduct Developers Statistics Cookie statement Mobile view Search Search Toggle the table of contents Web crawler 47 languages Add topic"
    },
    "2": {
        "url": "https://en.wikipedia.org/wiki/Main_Page",
        "text": "Wikipedia, the free encyclopedia Jump to content Main menu Main menu move to sidebar hide Navigation Main page Contents Current events Random article About Wikipedia Contact us Contribute Help Learn to edit Community portal Recent changes Upload file Special pages Search Search Appearance Donate Create account Log in Personal tools Donate Create account Log in Pages for logged out editors learn more Contributions Talk Main Page Main Page Talk English Read View source View history Tools Tools move to sidebar hide Actions Read View source View history General What links here Related changes Upload file Permanent link Page information Cite this page Get shortened URL Download QR code Print/export Download as PDF Printable version In other projects Wikimedia Commons Wikimedia Foundation MediaWiki Meta-Wiki Wikimedia Outreach Multilingual Wikisource Wikispecies Wikibooks Wikidata Wikifunctions Wikimania Wikinews Wikiquote Wikisource Wikiversity Wikivoyage Wiktionary Wikidata item Appearance move to sidebar hide From Wikipedia, the free encyclopedia Welcome to Wikipedia , the free encyclopedia that anyone can edit . 118,797 active editors 6,994,531 articles in English From today's featured article 15-, 17-, and 20-inch versions of the iMac G4 The iMac G4 is an all-in-one personal computer produced by Apple Computer from January 2002 to August 2004. It comprises a hemispheric base that holds the computer components and a flatscreen liquid-crystal display (LCD) mounted above. The iMac G3 , first released in 1998, helped save Apple from bankruptcy. Development of the iMac G4 took roughly two years, with Apple's designers exploring multiple ways of marrying the display screen with the computer components. Its shape was inspired by a sunflower, with the display connected to the base via an adjustable stainless-steel arm that allows the monitor to be freely tilted and swiveled. The product was a critical and commercial success for Apple, selling more than 1.3 million units in its first year, and it was updated with faster components and larger displays before being replaced by the iMac G5 in September 2004. The machine is held in the collections of multiple museums, including the Museum of Modern Art and Museums Victoria . ( Full article... ) Recently featured: Merchant's House Museum Marie Sophie Hingst Nasutoceratops Archive By email More featured articles About Did you know ... Bode Ioiô's taxidermied body ... that a liquor-drinking celebrity goat named Ioiô (pictured) won an election for city councilman in Fortaleza ? ... that Beyoncé 's \" Formation \" video topped Rolling Stone 's list of the \"100 Greatest Music Videos of All Time\" in 2021? ... that Jim Coffeen was the one of the first two quarterbacks for the Green Bay Packers , then served as the team's first public address announcer ? ... that Score! by Jilly Cooper was criticised for its treatment of sexual violence? ... that the court-appointed receiver for a California TV station noted that the business \"at least equal[ed] the most poorly managed companies I've seen\"? ... that stage director Tina Packer has hired Black and Asian actors in traditionally White Shakespearean roles? ... that kākā birds deeply scar Nothofagus menziesii trees while searching for the larvae of the pūriri moth ? ... that priests were secretly buried at St Catherine's Chapel, Lydiate , after it fell into ruin? ... that Hamengkubuwono III was appointed crown prince of Yogyakarta while his father was also still crown prince? Archive Start a new article Nominate an article In the news José Mujica Former president of Uruguay José Mujica (pictured) dies at the age of 89 . The Kurdistan Workers' Party announces its dissolution, ending its insurgency against Turkey. Robert Francis Prevost is elected as Pope Leo XIV , becoming the first Catholic pope born in the United States. Friedrich Merz is elected Chancellor of Germany and sworn in alongside his coalition government . Zhao Xintong defeats Mark Williams to win the World Snooker Championship . In horse racing, Sovereignty , ridden by Junior Alvarado , wins the Kentucky Derby . Ongoing : Gaza war M23 campaign Russian invasion of Ukraine timeline Sudanese civil war timeline Recent deaths : Sharpe James Matthew Best Simon Mann Douglas Gibson Chet Lemon Tom Farmer Nominate an article On this day May 16 : Malcolm X Day in some parts of the United States (2025) Junko Tabei 1426 – Mohnyin Thado captured Sagaing to become the king of Ava , in present-day Myanmar. 1605 – After a scuffle in which one cardinal received broken bones, a papal conclave convened in Rome elected Camillo Borghese as Pope Paul V . 1929 – The first Academy Awards ceremony was held at the Hollywood Roosevelt Hotel in Los Angeles, California. 1975 – Japanese climber Junko Tabei (pictured) became the first woman to reach the summit of Mount Everest . Pietro da Cortona ( d. 1669) William H. Seward ( b. 1801) Amanda Asay ( b. 1988) More anniversaries: May 15 May 16 May 17 Archive By email List of days of the year About From today's featured list The Church of the Good Shepherd , a Category 1 Historic Place at Lake Tekapo There are thirty listed sites located in the Mackenzie District , a territorial authority in the Canterbury Region of the South Island of New Zealand. A large inland plain at the foothills of the Southern Alps , it was frequently visited by Māori hunting parties, but sparsely populated. European settlers established sheep runs in the area by the 1850s. Heritage New Zealand classifies sites on the New Zealand Heritage List / Rārangi Kōrero in accordance with the Heritage New Zealand Pouhere Taonga Act 2014. It distinguishes between Category 1 (\"places of special or outstanding historical or cultural significance\") and Category 2 (\"places of historic or cultural significance\"). The Mackenzie District has three Category 1 sites, one historic area, and twenty-six Category 2 sites. An additional Category 2 site—the War Memorial in Fairlie —was demolished in 1999 and delisted. ( Full list... ) Recently featured: Seattle Reign FC seasons Governors of Edo State Nebula Award for Best Game Writing Archive More featured lists Today's featured picture Margaret Hamilton (December 9, 1902 – May 16, 1985) was an American entertainer and educator, with a fifty-year career in entertainment spanning theater, film, radio and television. She was best known for her portrayal of the Wicked Witch of the West and her Kansas counterpart Almira Gulch in the 1939 Metro-Goldwyn-Mayer film The Wizard of Oz . A former schoolteacher, she worked as a character actress in films for seven years before she was offered the role that defined her public image. In later years, Hamilton appeared in films and made frequent cameo appearances on television sitcoms and commercials . She also gained recognition for her work as an advocate of causes designed to benefit children and animals and retained a lifelong commitment to public education. This photograph shows Hamilton as Miss Eddels in Sid and Marty Krofft 's Sigmund and the Sea Monsters c. 1973 . Photograph credit: NBC Television Network ; restored by Adam Cuerden Recently featured: Kiwifruit Lysander Spooner Cape Barren goose Archive More featured pictures Other areas of Wikipedia Community portal – The central hub for editors, with resources, links, tasks, and announcements. Village pump – Forum for discussions about Wikipedia itself, including policies and technical issues. Site news – Sources of news about Wikipedia and the broader Wikimedia movement. Teahouse – Ask basic questions about using or editing Wikipedia. Help desk – Ask questions about using or editing Wikipedia. Reference desk – Ask research questions about encyclopedic topics. Content portals – A unique way to navigate the encyclopedia. Wikipedia's sister projects Wikipedia is written by volunteer editors and hosted by the Wikimedia Foundation , a non-profit organization that also hosts a range of other volunteer projects : Commons Free media repository MediaWiki Wiki software development Meta-Wiki Wikimedia project coordination Wikibooks Free textbooks and manuals Wikidata Free knowledge base Wikinews Free-content news Wikiquote Collection of quotations Wikisource Free-content library Wikispecies Directory of species Wikiversity Free learning tools Wikivoyage Free travel guide Wiktionary Dictionary and thesaurus Wikipedia languages This Wikipedia is written in English . Many other Wikipedias are available ; some of the largest are listed below. 1,000,000+ articles العربية Deutsch Español فارسی ‎ Français Italiano Nederlands 日本語 Polski Português Русский Svenska Українська Tiếng Việt 中文 250,000+ articles Bahasa Indonesia Bahasa Melayu Bân-lâm-gú Български Català Čeština Dansk Eesti Esperanto Euskara עברית Հայերեն 한국어 Magyar Norsk bokmål Română Simple English Slovenčina Srpski Srpskohrvatski Suomi Türkçe Oʻzbekcha 50,000+ articles Asturianu Azərbaycanca বাংলা Bosanski کوردی Ελληνικά Frysk Gaeilge Galego Hrvatski ქართული Kurdî Latviešu Lietuvių മലയാളം Македонски မြန်မာဘာသာ Norsk nynorsk ਪੰਜਾਬੀ Shqip Slovenščina ไทย తెలుగు اردو Retrieved from \" https://en.wikipedia.org/w/index.php?title=Main_Page&oldid=1276485694 \" 49 languages العربية Azərbaycanca বাংলা Български Bosanski Català Čeština Dansk Deutsch Eesti Ελληνικά Español Esperanto Euskara فارسی Français Galego 한국어 Hrvatski Bahasa Indonesia Italiano עברית ქართული Latviešu Lietuvių Magyar Македонски Bahasa Melayu Nederlands 日本語 Norsk bokmål Norsk nynorsk Polski Português Română Русский Simple English Slovenčina Slovenščina کوردی Српски / srpski Srpskohrvatski / српскохрватски Suomi Svenska ไทย Türkçe Українська Tiếng Việt 中文 This page was last edited on 19 February 2025, at 03:32 (UTC) . Text is available under the Creative Commons Attribution-ShareAlike 4.0 License ;\nadditional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy . Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc. , a non-profit organization. Privacy policy About Wikipedia Disclaimers Contact Wikipedia Code of Conduct Developers Statistics Cookie statement Mobile view Search Search Main Page 49 languages Add topic"
    },
    "3": {
        "url": "https://en.wikipedia.org/wiki/Wikipedia:Contents",
        "text": "Wikipedia:Contents - Wikipedia Jump to content Main menu Main menu move to sidebar hide Navigation Main page Contents Current events Random article About Wikipedia Contact us Contribute Help Learn to edit Community portal Recent changes Upload file Special pages Search Search Appearance Donate Create account Log in Personal tools Donate Create account Log in Pages for logged out editors learn more Contributions Talk Contents move to sidebar hide (Top) 1 Navigating Wikipedia's subjects Toggle Navigating Wikipedia's subjects subsection 1.1 Culture 1.2 Geography 1.3 Health 1.4 History 1.4.1 Timelines 1.4.2 Current history entries 1.5 Human activities 1.6 Mathematics and formal sciences 1.7 Natural sciences 1.8 People 1.9 Philosophy 1.10 Reference works 1.10.1 Third-party classification systems 1.10.2 Bibliographies 1.11 Religion 1.12 Society and social sciences 1.13 Technology and applied sciences 2 Wikipedia's main content systems Toggle Wikipedia's main content systems subsection 2.1 Overview articles 2.2 Outline pages 2.3 List pages 2.4 Portals 2.5 Glossaries 2.6 Category system 3 Articles by importance or quality Toggle Articles by importance or quality subsection 3.1 Vital articles 3.2 List of articles every Wikipedia should have 3.3 Featured content 3.4 Good content 4 Spoken articles 5 Alphabetical lists of articles Toggle the table of contents Wikipedia : Contents 47 languages العربية অসমীয়া تۆرکجه বাংলা भोजपुरी Чӑвашла Cebuano Español فارسی ГӀалгӀай 한국어 हिन्दी Hrvatski Bahasa Indonesia Қазақша Коми Kurdî Magyar മലയാളം Bahasa Melayu မြန်မာဘာသာ Nederlands नेपाली 日本語 Oʻzbekcha / ўзбекча پښتو ភាសាខ្មែរ Polski Português Русский ᱥᱟᱱᱛᱟᱲᱤ සිංහල سنڌي Српски / srpski Sunda Suomi Tagalog தமிழ் Татарча / tatarça တႆး తెలుగు ไทย Українська Xitsonga ייִדיש 粵語 中文 Edit links Project page Talk English Read View source View history Tools Tools move to sidebar hide Actions Read View source View history General What links here Related changes Upload file Permanent link Page information Get shortened URL Download QR code Print/export Download as PDF Printable version In other projects Wikiversity Wikidata item Appearance move to sidebar hide From Wikipedia, the free encyclopedia List of Wikipedia's tables of contents Overviews Outlines Lists Portals Glossaries Categories Vital articles Featured content Good articles Indices A–Z index Reference Culture Geography Health History Human activities Mathematics Nature People Philosophy Religion Society Technology \"WP:START\" redirects here. For Wikipedia's criteria for Start-class articles, see WP:STARTCLASS . This page lists Wikipedia's tables of contents. For Wikipedia's community directory, see Wikipedia:Directories and indexes . Shortcuts WP:START WP:EXPLORE Explore the vast knowledge of Wikipedia through these helpful resources. If you have a specific topic in mind, use Wikipedia's search box. If you don't know exactly what you are looking for or wish to explore broad areas, click on a link in the header menu at the top of this page, or begin your browsing below: Navigating Wikipedia's subjects Wikipedia organizes its content into distinct subject classifications, each with further subdivisions. Culture Explore the diverse cultures, arts, beliefs, and customs of human societies. Culture Geography Discover the wonders of Earth's lands, features, inhabitants, and planetary phenomena. Geography Health Learn about physical, mental, and social health. Health History Dive into the past through written records and scholarly exploration. History Timelines Explore chronological events through our comprehensive timelines. List of timelines Current history entries Stay up-to-date with encyclopedia entries covering ongoing events. 2025 – Major events this year 2025 in science – Ongoing science findings and technology advancements Portal:Current events – Featured current events and related project activities Human activities Delve into diverse human actions, from leisure and entertainment to industry and warfare. Human activities Mathematics and formal sciences Explore the study of quantity, structure, space, and change. Mathematics and logic Natural sciences Understand natural phenomena through empirical evidence, observations, and experiments. Natural and physical sciences People Learn about collective entities, ethnic groups, and nations. People Philosophy Dive deep into fundamental questions about existence, knowledge, values, and more. Philosophy Reference works Access comprehensive information collections compiled for easy retrieval. Reference works Third-party classification systems Refer to various third-party classification systems linked to Wikipedia articles. Library of Congress Classification List of Dewey Decimal classes Figurative system of human knowledge ( Encyclopédie ) Propædia ( Encyclopædia Britannica ) Tree of knowledge system Universal Decimal Classification Bibliographies Access sources on specific topics for further reading or verification. Wikipedia:List of bibliographies – Compilation of bibliographies Category:Wikipedia bibliographies – Multi-page catalog of Wikipedia's bibliographies Religion Explore social-cultural systems, beliefs, ethics, and more. Religion Society and social sciences Understand collectives, social interactions, political authority, and cultural norms. Society Technology and applied sciences Learn about techniques, skills, methods, and processes in technology and science. Technology Wikipedia's main content systems Overview articles Get summaries of broad topics with links to subtopics, biographies, and related articles. Overview articles Outline pages Explore topics in outline format, linking to more detailed articles. Outline pages List pages Find enumerations of specific types, such as lists of countries and people. List pages Portals Access featured articles, images, news, and more through thematic portals. Portals Glossaries Access lists of terms with definitions through alphabetical glossaries. Glossaries Category system Browse Wikipedia's category pages, which index articles by subject. Category:Main topic classifications – Arts, History, Technology, and more Wikipedia:Contents/Categories – Hand-crafted list of topic categories Category:People – Biographies Articles by importance or quality Vital articles Explore subjects that demand high-quality articles, grouped by importance. Vital articles Level 1 – 10 most important articles Level 2 – 100 most important articles Level 3 – 1,000 most important articles Level 4 – 10,000 most important articles Level 5 – 50,000 most important articles List of articles every Wikipedia should have Explore topics where Wikipedias of all languages should have articles. List of articles every Wikipedia should have List of articles every Wikipedia should have/Expanded Featured content Discover Wikipedia's best, reviewed and vetted for quality. Featured content Featured articles Featured lists Featured pictures Featured topics Good content Explore well-written, factually accurate articles that meet editorial standards. Good articles Good topics Spoken articles Listen to Wikipedia articles as spoken word recordings. Category:Spoken articles Wikipedia:Spoken articles Alphabetical lists of articles Browse Wikipedia's articles alphabetically. Special:Allpages – List of all current pages Wikipedia:Contents/A–Z index – Alphabetical index Category:Wikipedia indexes – Alphabetical list of topic indexes Wikipedia:Contents/Indices – Indexes sorted by topic area Content listings Topics Current events Reference Culture Geography Health History Mathematics Nature People Philosophy Religion Society Technology Types Vital articles Featured content Good articles Spoken articles Overviews Outlines Lists Portals Glossaries Categories Indices Places, people and times Academic disciplines Anniversaries (days of the year) today Sovereign states and dependent territories Timelines decades, centuries, and millennia Indices A–Z index Categories Dewey Decimal classes Library of Congress Classification v t e Wikipedia directories and indexes Administration pages Protocols Policies Guidelines Manual of Style Assistance Help directory Menu FAQs Interactive help Reader's index Tips Styletips Tools The community Portal Discussions Noticeboards Essays Editor's index Departments Maintenance WikiProjects MediaWiki Wikitext HTML Templates Locutions Abbreviations Edit summaries Glossary Shortcuts Encyclopedia proper Types Overviews Outlines Lists Portals Glossaries Categories Indices Featured , good Featured articles Good articles Featured lists Featured pictures Featured topics Good topics Topics Current events Reference Culture Geography Health History Math Nature People Philosophy Religion Society Technology LOC, bios, times Academic disciplines Anniversaries Today Sovereign states and dependent territories Deaths this year Timelines Decades, centuries, and millennia Indexes A–Z index Categories Dewey Decimal classes Library of Congress Classification Spoken articles Searching Retrieved from \" https://en.wikipedia.org/w/index.php?title=Wikipedia:Contents&oldid=1289583872 \" Categories : Wikipedia directories Wikipedia contents Wikipedia navigation Hidden categories: Wikipedia semi-protected project pages Wikipedia move-protected project pages This page was last edited on 9 May 2025, at 14:37 (UTC) . Text is available under the Creative Commons Attribution-ShareAlike 4.0 License ;\nadditional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy . Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc. , a non-profit organization. Privacy policy About Wikipedia Disclaimers Contact Wikipedia Code of Conduct Developers Statistics Cookie statement Mobile view Search Search Toggle the table of contents Wikipedia : Contents 47 languages Add topic"
    },
    "4": {
        "url": "https://en.wikipedia.org/wiki/Portal:Current_events",
        "text": "Portal:Current events - Wikipedia Jump to content Main menu Main menu move to sidebar hide Navigation Main page Contents Current events Random article About Wikipedia Contact us Contribute Help Learn to edit Community portal Recent changes Upload file Special pages Search Search Appearance Donate Create account Log in Personal tools Donate Create account Log in Pages for logged out editors learn more Contributions Talk Portal : Current events 118 languages Ænglisc العربية অসমীয়া अवधी Авар تۆرکجه Banjar 閩南語 / Bân-lâm-gú Башҡортса Беларуская भोजपुरी Bikol Central Català Чӑвашла Cebuano Čeština ChiTumbuka Dagbanli Dansk Deutsch ދިވެހިބަސް डोटेली Ελληνικά Эрзянь Español Esperanto Estremeñu Euskara Eʋegbe فارسی Føroyskt Français Gaeilge Gaelg 贛語 گیلکی ગુજરાતી 客家語 / Hak-kâ-ngî 한국어 Հայերեն हिन्दी Hrvatski Bahasa Indonesia Interlingua Ирон IsiZulu Íslenska ಕನ್ನಡ Kapampangan ქართული Қазақша Kurdî Ladino Latina Lëtzebuergesch Lietuvių Li Niha Limburgs Magyar मैथिली മലയാളം मराठी مصرى مازِرونی Bahasa Melayu Minangkabau Монгол မြန်မာဘာသာ Nāhuatl Nederlands नेपाली नेपाल भाषा 日本語 Napulitano Нохчийн Occitan Oʻzbekcha / ўзбекча ਪੰਜਾਬੀ پنجابی پښتو Piemontèis Polski Português Qaraqalpaqsha Română Русиньскый Русский Scots Sicilianu සිංහල سنڌي Slovenščina Soomaaliga کوردی Српски / srpski Sunda Suomi Svenska Tagalog தமிழ் Татарча / tatarça ไทย Тоҷикӣ ᏣᎳᎩ Tyap Українська اردو Vepsän kel’ Tiếng Việt Volapük Walon 文言 吴语 ייִדיש Yorùbá 粵語 Zeêuws 中文 Edit links Portal Talk English Read View source View history Tools Tools move to sidebar hide Actions Read View source View history General What links here Related changes Upload file Permanent link Page information Get shortened URL Download QR code Print/export Download as PDF Printable version In other projects Wikidata item Appearance move to sidebar hide Edit instructions From Wikipedia, the free encyclopedia Portal maintenance status: (October 2020) This portal's subpages have been checked by an editor, and are needed. Please take care when editing, especially if using automated editing software . Learn how to update the maintenance information here . Wikipedia portal for content related to Current events Wikimedia portal Worldwide current events Sports events Recent deaths Entry views by week list Wikimedia portal Topics in the news José Mujica Former president of Uruguay José Mujica (pictured) dies at the age of 89 . The Kurdistan Workers' Party announces its dissolution, ending its insurgency against Turkey. Robert Francis Prevost is elected as Pope Leo XIV , becoming the first Catholic pope born in the United States. Friedrich Merz is elected Chancellor of Germany and sworn in alongside his coalition government . Zhao Xintong defeats Mark Williams to win the World Snooker Championship . In horse racing, Sovereignty , ridden by Junior Alvarado , wins the Kentucky Derby . Ongoing : Gaza war M23 campaign Russian invasion of Ukraine timeline Sudanese civil war timeline Recent deaths : Sharpe James Matthew Best Simon Mann Douglas Gibson Chet Lemon Tom Farmer Nominate an article May 16, 2025 ( 2025-05-16 ) (Friday) edit history watch Armed conflicts and attacks Gaza war Israeli bombing of the Gaza Strip More than 74 people are killed in Israeli strikes on the Gaza Strip since midnight. (RTÉ News) Disasters and accidents Five people are killed and three others are injured after a landslide at a hydropower plant construction site in Phong Thổ , Lai Châu province , Vietnam . (News.az) Law and crime Stabbing of Salman Rushdie A court in New York , United States sentences a man to 25 years in prison for the August 2022 stabbing attack on Indian-British-American author Salman Rushdie , which left Rushdie severely injured while he was giving a talk in Chautauqua . (AP) Eleven inmates are missing after a mass escape from the Orleans Parish jail in New Orleans , Louisiana , United States. Two are quickly recaptured, nine remain fugitives. ( New Orleans Times-Picayune ) May 15, 2025 ( 2025-05-15 ) (Thursday) edit history watch Armed conflicts and attacks Islamist insurgency in Burkina Faso Islamist militant group Jama'at Nasr al-Islam wal-Muslimin claims it killed 200 soldiers in an attack on a military base on Sunday in Djibo , Sahel , Burkina Faso . They also claimed responsibility for another attack this week at a military post in Loroum Province that killed 60 soldiers. (Al Jazeera) Papua conflict The Indonesian military confirms that 18 Papuan separatists and three civilians were killed in yesterday's military operation in Intan Jaya Regency , Central Papua , Indonesia . (Reuters) (detikcom) Arts and culture A long-lost version of the British Magna Carta , dating to 1300 in the reign of King Edward I , is believed to have been found at Harvard University in the United States . (BBC) ( The Guardian ) Disasters and accidents 2025 Canadian wildfires Two people are killed and more than 1,000 others evacuate after wildfires spread across central Manitoba , Canada . (Euronews) Sinking of the Bayesian British investigators say the cause of the sinking of the Bayesian superyacht that killed seven people, including billionaire tech magnate Mike Lynch in Italy in 2024, is from being knocked over by extreme wind and could not recover. (CTV News) Five people are killed and three others are injured after a van drives into the back of a truck on the national road 2 in Konotopa , Masovian Voivodeship , Poland . (TVN24) Three people, including two firefighters, are killed and two other firefighters are seriously injured in a fire at a former Royal Air Force base in Oxfordshire , England . (BBC News) International relations Iran–United States relations 2025 US–Iran negotiations U.S. president Donald Trump says that the U.S. and Iran have \"sort of\" agreed on the terms of a deal on Iran's nuclear program , which reportedly includes Iran agreeing to give up highly enriched uranium while keeping lower-grade uranium needed for civilian nuclear power , in exchange for the lifting of sanctions . (AP) Myanmar–Vietnam relations According to the Vietnamese foreign ministry , more than 650 Vietnamese nationals are detained for immigration violations in Myanmar . The Vietnamese public security ministry has repatriated 450 people, with 200 still in Myanmar. (Vietnam+) ( Việt Nam News ) Visa policy of mainland China At the China-CELAC Forum in Beijing , the Chinese foreign ministry announces it will allow nationals from Argentina , Brazil , Chile , Peru , and Uruguay to enter the country without a travel visa starting June 1. (AP) Law and crime Capital punishment in Florida The U.S. state of Florida executes serial killer Glen Edward Rogers for the 1995 murder of a woman at a motel in Tampa . ( The Washington Post ) LGBT rights in Russia , Russian anti-LGBTQ law Russian media reports that police raided the publisher office of Eksmo Publishing House yesterday and arrested several of its employees, accusing them of spreading \" LGBTQ + extremism\". ( The Moscow Times ) Politics and elections 2025 Australian Greens leadership election Larissa Waters is elected leader of the Australian Greens , following the resignation of Adam Bandt after the party's poor performance at the 2025 Australian federal election . (ABC News) Sports 2024–25 La Liga In association football , FC Barcelona win their 28th title in the 94th season of La Liga after defeating city rivals RCD Espanyol 2–0 with two matches to spare. (ESPN) ( The Independent ) May 14, 2025 ( 2025-05-14 ) (Wednesday) edit history watch Armed conflicts and attacks Israeli–Palestinian conflict Gaza war Israeli bombing of the Gaza Strip Israeli airstrikes kill at least 80 Palestinians across the Gaza Strip . (Reuters) Palestinian political violence Two Israelis , including a pregnant woman and her child, are critically wounded in a shooting near Brukhin in the West Bank . ( The Jerusalem Post ) (YNet) Hezbollah–Israel conflict Israeli invasion of Lebanon The Israel Defense Forces claim that a drone strike in Qaaqaait al-Jisr , Nabatieh Governorate , Lebanon , killed a Hezbollah commander. ( The Times of Israel ) Naxalite–Maoist insurgency Operation Black Forest Indian authorities declare a \"major success\" in a military operation against Naxal insurgents in the border between the states of Chhattisgarh and Telangana , killing 31 militants, including top leaders of the Maoist group. ( The Hindustan Times ) Disasters and accidents Two hikers are found dead and seven others are rescued after they were swept away by a river while hiking near Didier Waterfall on the island of Martinique . (AP) International relations China–Colombia relations Colombia joins China 's Belt and Road Initiative during the China-CELAC Forum in Beijing . (AFP via RFI) Syria–United States relations U.S. president Donald Trump meets with Syrian interim president Ahmed al-Sharaa during a trip to Saudi Arabia prior to departing for Qatar , marking the first meeting between a U.S. and Syrian president since 2000. (Al Jazeera) Law and crime Immigration to Argentina Argentine president Javier Milei orders restrictions on immigration to Argentina , saying that immigrants are bringing \"chaos and abuse\" to Argentina. (AP) Tajik president Emomali Rahmon signs a law decriminalizing the \" liking \" of posts on social media publicly calling for terrorism or other serious crimes. (Reuters) Russian election observer Grigory Melkonyants [ ru ] is convicted on charges of working with an \"undesirable organization\" and sentenced to five years in prison. ( The New York Times ) Politics and elections Deportation of undocumented Afghans from Pakistan Pakistani interior minister Mohsin Naqvi says that more than 1 million Afghans have been deported back to Afghanistan since November 2023 as Pakistani authorities intensify a crackdown on illegal immigration . (AMU TV) May 13, 2025 ( 2025-05-13 ) (Tuesday) edit history watch Armed conflicts and attacks Gaza war 2025 Gaza European Hospital strikes At least 28 people are killed in an Israeli air strike that struck the Gaza European Hospital , which the Israeli military claims had a Hamas command and control centre beneath the building. (BBC News) Puntland counter-terrorism operations Three Al-Shabaab fighters, including a senior commander, are killed in a coordinated operation by the Somali National Army in Jowle , Mudug , Puntland . (Garowe Online) Business and economy Microsoft Inc. abruptly lays off 6,000 people, 3% of its global workforce, citing workforce productivity . (AP) (GeekWire) Disasters and accidents 2025 Russian wildfires A state of emergency is declared in Buryatia , Far Eastern Federal District , Russia , as firefighters fight wildfires currently burning more than 53,000 hectares. ( The Moscow Times ) Fourteen people are killed and four others are hospitalized after drinking toxic liquor in Amritsar , Punjab , India . (AP) International relations Syria–United States relations US President Donald Trump announces that the United States will lift all sanctions imposed on Syria under the previous regime of President Bashar al-Assad , and expresses willingness to work with the Syrian transitional government . (Al Jazeera) Law and crime Armed conflict for control of the favelas Brazilian Military Police kill the main leader of the Terceiro Comando Puro , a drug trafficking criminal organization , and two other suspected members, in a shootout in the Maré favela in Rio de Janeiro . (AP) ( Seattle Post-Intelligencer ) Politics and elections Islamic State insurgency in Puntland Puntland counter-terrorism operations A spokesperson for the Puntland Security Force confirms that Puntland has acquired four military helicopters to support ongoing military operations against Islamic State militants in the region. (Garowe Online) 2025 Liberal Party of Australia leadership election Sussan Ley is elected as the new leader of the Liberal Party of Australia following the party's defeat at Saturday's federal election . Ley is the first woman to hold the post. (Reuters) 2025 Malian protests , 2020 Malian coup d'état Malian interim president Assimi Goïta signs a decree dissolving all political parties and organizations and bans them from holding meetings following ongoing pro- democracy protests in the capital city Bamako . (AP) (Al Jazeera) Prime Minister of Peru Gustavo Adrianzén resigns a day before a vote of censure against him over rising crime in Peru . (Reuters) Sports Major League Baseball Commissioner of Baseball Rob Manfred announces that all deceased individuals on the permanent ineligible list will be reinstated, allowing players like Pete Rose and Shoeless Joe Jackson to be elected into the National Baseball Hall of Fame and Museum . (ESPN) 2024–25 Serie B Multiple European and domestic title winners UC Sampdoria are relegated to the third tier of the Italian football league system for the first time in their 78 year history. ( ESPN ), ( BBC Sport ), ( The Guardian ) May 12, 2025 ( 2025-05-12 ) (Monday) edit history watch Armed conflicts and attacks Gaza war Gaza war hostage crisis Israeli-American hostage Edan Alexander is released by Hamas after being kept in captivity in Gaza for 19 months since the October 7 attack . (Reuters) Libyan crisis 2025 Tripoli clashes Clashes erupt between rival militia gunmen from the 444th Brigade and the Stability Support Apparatus in Tripoli , Libya , after the assassination of Commander Abdel Ghani al-Kikli . Six people are injured, and a state of emergency is declared by authorities. ( The Jerusalem Post ) (Al Jazeera English) Kurdistan Workers' Party insurgency At its 12th Congress, the Kurdistan Workers' Party announces an immediate halt to its insurgent activities in Turkey and plans for its formal dissolution. (Al Jazeera) (Reuters) Myanmar civil war The National Unity Government of Myanmar says that an airstrike by junta forces killed 17 students and injured 20 others at a school in Tabayin , Sagaing Region . (Reuters) Syrian civil war The remains of 30 people believed to have been killed by Islamic State militants are found in a search by Qatar and the U.S. Federal Bureau of Investigation in the remote town of Dabiq , Aleppo Governorate , Syria . (CTV News) Unknown gunmen attack a Chinese artisanal gold mine in Narena , Koulikoro Region , Mali , killing one Malian and two others from Ghana , and abducting two Chinese nationals. (AP) Disasters and accidents Thirteen people are killed by an expired ammunition explosion in Garut Regency , West Java , Indonesia . ( Jakarta Globe ) International relations China–United States trade war The U.S. and China agree to a trade deal in which, for 90 days, U.S. tariffs on most Chinese goods will drop from 145% to 30%, while China's retaliatory tariffs on U.S. goods will drop from 125% to 10%. (BBC News) Immigration policy of the second Donald Trump administration , South Africa–United States relations The first group of Afrikaners arrive in the United States after U.S. president Donald Trump grants refugee status to the white minority group, who Trump says face a \"genocide\" in the South African farm attacks . The government of South Africa rejects the claims. (AP) Politics and elections 2025 Philippine general election Filipinos vote to elect all 317 members of the House of Representatives and 12 members of the Senate , in addition to local elections . ( Asian Journal ) (Reuters) May 11, 2025 ( 2025-05-11 ) (Sunday) edit history watch Armed conflicts and attacks Gaza war Israeli bombing of the Gaza Strip Fifteen Palestinians , mostly women and children, are killed in overnight Israeli airstrikes across the Gaza Strip . (CTV News) Gaza war hostage crisis Hamas agrees to release Edan Alexander , a dual American-Israeli citizen hostage, tomorrow. (Reuters) Russian invasion of Ukraine Peace negotiations in the Russian invasion of Ukraine Russian President Vladimir Putin proposes holding direct negotiations in Istanbul , Turkey , on May 15 after the United Kingdom , France , Germany and Poland threatened further sanctions if it does not agree to an unconditional 30-day ceasefire beginning on May 12. (Reuters) Ukrainian President Volodymyr Zelenskyy calls on Russia to confirm an unconditional ceasefire before any direct negotiations between the two nations. (Reuters) Insurgency in Khyber Pakhtunkhwa At least two police officers are killed and three others are injured in a roadside bombing targeting a police vehicle in Khyber Pakhtunkhwa , Pakistan . (CTV News) Israeli MIAs The body of Israel Defense Forces soldier Zvi Feldman, missing since the 1982 Lebanon War , is repatriated to Israel from \"deep inside Syria \" in a joint Mossad –IDF operation. ( The Times of Israel ) (AP) Disasters and accidents Mediterranean Sea migrant smuggling Three people are found dead, including two children, on a dinghy crossing the Mediterranean Sea from Libya to Italy . German NGO RESQSHIP intercepts the boat and brings the remaining 59 survivors to Lampedusa . (DW) A bus carrying Buddhist pilgrims in Kotmale , Sri Lanka , swerves off a cliff , killing 21 people and injuring 35 others. (CTV News) Five people are killed, dozens are injured including three critically, and hundreds are displaced in a fire at a four-story apartment building in Milwaukee , Wisconsin , United States. (WTMJ-TV) (CNN) A runner collapses and later dies near the finish line during running event Loop Leeuwarden in Leeuwarden , Netherlands , causing the organizers to cancel the event. (NOS) International relations Poland–Russia relations Polish authorities confirm evidences of Russian sabotage behind the arson attack that destroyed most of the Marywilska 44 marketplace in Warsaw in 2024. As a reaction, the Russian consulate general in Kraków is ordered to close down. ( The Guardian ) (AP) In his first Sunday address, Pope Leo XIV calls for peace in Ukraine , the release of all war prisoners and the return of abducted Ukrainian children to their families, an immediate ceasefire , the release of all hostages and the allowance of humanitarian aid in Gaza , as well as a permanent ceasefire to the India–Pakistan conflict . ( The Guardian ) Law and crime The Taliban bans chess in Afghanistan , with a Taliban spokesman saying that chess is considered a form of gambling under Sharia law. (BBC News) Politics and elections 2025 Albanian parliamentary election Albanians vote to elect the 140 members of the Parliament , as Prime Minister Edi Rama seeks reelection for a fourth term. (Reuters) May 10, 2025 ( 2025-05-10 ) (Saturday) edit history watch Armed conflicts and attacks Gaza war Israeli bombing of the Gaza Strip At least 23 Palestinians are killed, including three children, in overnight Israeli airstrikes on Gaza City , Palestine . (CTV News) 2025 India–Pakistan conflict Pakistan announces Operation Bunyanun Marsoos , the start of large-scale military action against India . (Samaa.tv) Pakistan Air Force warplanes launch airstrikes throughout India with missile strikes targeting Udhampur , Pathankot Airport and a BrahMos missile storage facility in Beas City , Punjab . (Al Jazeera) A Pakistani Fatah-II missile is intercepted over the city of Sirsa in the Indian state of Haryana . (News18) India announces the temporary closure of its airspace over the northern and western regions of the country until May 14. (Al Jazeera) United States President Donald Trump and Pakistani Deputy Prime Minister Ishaq Dar announce a full and immediate ceasefire between India and Pakistan, mediated by the U.S. Indian Foreign Secretary Vikram Misri later confirms the ceasefire as well. (BBC News) Violations of the ceasefire and new clashes are reported shortly after the announcement of the agreement. (Reuters) Ecuadorian conflict Ecuador announces a three-day mourning period after eleven soldiers are killed in an ambush by guerrillas. (News Express) Sudanese civil war At least 19 prisoners are killed and 45 others are injured in an airstrike by the Rapid Support Forces on a prison in Obeid, North Kordofan , Sudan . (CTV News) Disasters and accidents At least seven people die and others are injured over two districts in Mogadishu , Somalia , after a flood triggered by severe rainfall sweeps infrastructure including Aden Adde Airport . The rain also collapses nine houses and floods over 200 others. (Reuters) (Devdiscourse) Four people are injured and 150,000 people are issued health warnings and stay-indoors orders when a chemical plant catches fire in Vilanova i la Geltrú , Catalonia , Spain . (CTV News) Politics and elections The government of Bangladesh bans the Awami League party of former Prime Minister Sheikh Hasina , who was ousted last year during mass protests , before her flight to India . (AP) Science and technology Soviet space program Kosmos 482 , a failed Venus probe launched by the Soviet Union in 1972, re-enters Earth's atmosphere, splashing down in the Indian Ocean west of Indonesia , according to Roscosmos . ( The Guardian ) (CNN) More May 2025 events... Time : 18:37 UTC | Day : 16 May ◀ May 2025 ▶ S M T W T F S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 More May 2025 events... Wikimedia portal About this page • News about Wikipedia Ongoing events Disasters Avian flu outbreak United States opioid epidemic Economics Chinese property sector crisis German economic crisis United Kingdom cost-of-living crisis United States tariff policy United States–China trade war Politics and diplomacy Gaza war hostage crisis India–Pakistan standoff Protests and strikes Gaza war protests Georgian protests and political crisis Indonesian anti-government protests Serbian anti-corruption protests Turkish anti-government protests edit section Elections and referendums Recent May 0 3: Australia , Senate, House of Representatives 0 3: Singapore , Parliament 0 3: Togo , President (indirect) 0 4: Romania , President (1st) 7–8: Vatican City , Pope (indirect) 11: Albania , Parliament 12: Philippines , Senate , House of Representatives Upcoming 18: Poland , President 18: Portugal , Assembly of the Republic 18: Romania , President (2nd) 25: Suriname , National Assembly 25: Venezuela , National Assembly edit section Trials Recently concluded South Korea: 0 Yoon Suk Yeol Ongoing United States: 0 Sean Combs edit section Sports Association football 2024–25 UEFA Champions League 2024–25 UEFA Europa League 2024–25 UEFA Conference League 2024–25 UEFA Women's Champions League 2024–25 Premier League 2024–25 Serie A 2024–25 La Liga 2024–25 Bundesliga 2024–25 Ligue 1 2025 Major League Soccer season 2025 National Women's Soccer League season Australian rules football 2025 AFL season Baseball 2025 MLB season Basketball 2025 NBA playoffs 2024–25 EuroLeague 2025 WNBA season International cricket 2023–25 ICC World Test Championship 2025 IPL season Cycling 2025 UCI World Tour Golf 2025 PGA Tour 2025 PGA Championship 2025 LIV Golf League 2025 LPGA Tour Ice hockey 2025 Stanley Cup playoffs 2025 PWHL playoffs Motorsport 2025 Formula One World Championship 2025 MotoGP World Championship 2025 NASCAR Cup Series 2025 IndyCar Series Rugby league 2025 NRL season 2025 Super League season Rugby union 2024–25 European Rugby Champions Cup 2024–25 Premiership Rugby 2024–25 United Rugby Championship 2025 Super Rugby Pacific season Tennis 2025 ATP Tour 2025 WTA Tour More details – current sports events edit section Recent deaths May 0 / 0 April 15: Charles Strouse 13: Kit Bond 13: José Mujica 11: Robert Benton 11: Sabu 0 9: Greg Cannom 0 9: Margot Friedländer 0 9: Johnny Rodriguez 0 8: David Souter 0 8: Chet Lemon 0 7: Joe Don Baker 0 6: James Foley 0 6: Joseph Nye 0 5: James Baker 0 4: Jochen Mass 0 3: Sırrı Süreyya Önder 0 2: George Ryan 0 1: Ruth Buzzi 0 1: Jill Sobule 29: David Horowitz 29: Mike Peters 28: Priscilla Pointer 28: Shaji N. Karun 27: Dick Barnett 27: Cora Sue Collins 27: Jiggly Caliente 27: Stan Love 25: Virginia Giuffre 25: Alexis Herman 25: Philip Lowrie 25: Yaroslav Moskalik 24: Rob Holland 23: Steve McMichael 23: David Thomas 22: Lar Park Lincoln 22: Zurab Tsereteli 22: Puan Noor Aishah 22: Keith Stackpole 21: Pope Francis 21: Will Hutchins 21: Hajji Alejandro 20: Mike Patrick 19: Jay Sigel 19: Guy Ullens 18: Clodagh Rodgers 17: Joe Thompson 16: Nora Aunor 15: Wink Martindale edit section Ongoing conflicts Global War against the Islamic State Africa Cameroon Anglophone Crisis Central African Republic Civil war Democratic Republic of the Congo and Rwanda Kivu conflict Nigeria Boko Haram insurgency Sahel insurgency Mali War Burkina Faso Niger Somalia Civil war Sudan Civil war Americas Haiti Gang war Mexico Mexican drug war Asia−Pacific Afghanistan Islamic State–Taliban conflict India Naxalite–Maoist insurgency India and Pakistan Kashmir conflict Myanmar Civil war Pakistan Insurgency in Balochistan Insurgency in Khyber Pakhtunkhwa Philippines NPA rebellion Europe Russia and Ukraine Russian invasion of Ukraine Middle East Israel Gaza war Syria Israeli invasion of Syria Yemen Red Sea crisis See also – List of ongoing proxy wars edit section 2025 events and developments by topic Arts Animation ( Anime ) Architecture Comics Film ( Horror , Science fiction ) Literature ( Poetry ) Music ( Classical , Country , Hip hop , Jazz , Latin , Metal , Rock , UK , US , Korea ) Radio Television ( Australia , Canada , Ireland , UK , Scotland , US ) Video games Politics and government Elections International leaders Sovereign states Sovereign state leaders Territorial governors Science and technology Archaeology Biotechnology Computing Palaeontology Quantum computing and communication Senescence research Space/Astronomy Spaceflight Sustainable energy research Environment and environmental sciences Climate change Weather ( Heat waves Tornadoes Wildfires ) Transportation Aviation Rail transport Transportation technology By place Afghanistan Albania Algeria Andorra Angola Antarctica Antigua and Barbuda Argentina Armenia Australia Austria Azerbaijan Bangladesh The Bahamas Bahrain Barbados Belarus Belgium Belize Benin Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil Brunei Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Central African Republic Chad Chile China Colombia Costa Rica Comoros Congo DR Congo Croatia Cuba Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Eritrea Estonia Ethiopia Eswatini Equatorial Guinea Fiji Finland France Gabon The Gambia Georgia Germany Ghana Greece Grenada Guatemala Guinea Guinea-Bissau Guyana Haiti Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Israel Italy Ivory Coast Jamaica Japan Jordan Kazakhstan Kenya Kiribati Kosovo Kuwait Kyrgyzstan Laos Latvia Lebanon Lesotho Liberia Liechtenstein Libya Lithuania Luxembourg Macau Madagascar Marshall Islands Malawi Malaysia Maldives Mali Malta Mauritania Mauritius Mexico Micronesia Moldova Monaco Mongolia Montenegro Morocco Mozambique Myanmar Nauru Namibia Nepal Netherlands New Zealand Nicaragua Niger Nigeria North Korea North Macedonia Norway Oman Pakistan Palau Palestine Panama Papua New Guinea Paraguay Peru Philippines Poland Portugal Qatar Romania Russia Rwanda Saint Kitts and Nevis Saint Lucia Saint Vincent and the Grenadines Samoa San Marino São Tomé and Príncipe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Slovakia Slovenia Somalia South Africa Solomon Islands South Korea South Sudan Spain Sri Lanka Sudan Suriname Sweden Switzerland Syria Taiwan Tajikistan Tanzania Thailand Timor-Leste Togo Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Vatican City Venezuela Vietnam Yemen Zambia Zimbabwe Establishments and disestablishments categories Establishments Disestablishments Works and introductions categories Works Introductions Works entering the public domain 2025 at Wikipedia's sister projects Media from Commons News from Wikinews Quotations from Wikiquote Texts from Wikisource Taxa from Wikispecies Discussions from Meta-Wiki ...more edit section v t e Current events by month 2025 January February March April May 2024 January February March April May June July August September October November December 2023 January February March April May June July August September October November December 2022 January February March April May June July August September October November December 2021 January February March April May June July August September October November December 2020 January February March April May June July August September October November December 2019 January February March April May June July August September October November December 2018 January February March April May June July August September October November December 2017 January February March April May June July August September October November December 2016 January February March April May June July August September October November December 2015 January February March April May June July August September October November December 2014 January February March April May June July August September October November December 2013 January February March April May June July August September October November December 2012 January February March April May June July August September October November December 2011 January February March April May June July August September October November December 2010 January February March April May June July August September October November December 2009 January February March April May June July August September October November December 2008 January February March April May June July August September October November December 2007 January February March April May June July August September October November December 2006 January February March April May June July August September October November December 2005 January February March April May June July August September October November December 2004 January February March April May June July August September October November December 2003 January February March April May June July August September October November December 2002 January February March April May June July August September October November December Portal:Current events Calendars Discover Wikipedia using portals List of all portals The arts portal Biography portal Current events portal Geography portal History portal Mathematics portal Science portal Society portal Technology portal Random portal WikiProject Portals Retrieved from \" https://en.wikipedia.org/w/index.php?title=Portal:Current_events&oldid=1234748158 \" Categories : All portals 2025 by day Current events portal 2025 Current events WikiProject Current events History portals Hidden categories: Wikipedia pages protected against vandalism Portals with triaged subpages from October 2020 All portals with triaged subpages Portals with no named maintainer This page was last edited on 15 July 2024, at 23:17 (UTC) . Text is available under the Creative Commons Attribution-ShareAlike 4.0 License ;\nadditional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy . Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc. , a non-profit organization. Privacy policy About Wikipedia Disclaimers Contact Wikipedia Code of Conduct Developers Statistics Cookie statement Mobile view Search Search Portal : Current events 118 languages Add topic"
    },
    "5": {
        "url": "https://en.wikipedia.org/wiki/Special:Random",
        "text": "Robert Robinson (cricketer, born 1924) - Wikipedia Jump to content Main menu Main menu move to sidebar hide Navigation Main page Contents Current events Random article About Wikipedia Contact us Contribute Help Learn to edit Community portal Recent changes Upload file Special pages Search Search Appearance Donate Create account Log in Personal tools Donate Create account Log in Pages for logged out editors learn more Contributions Talk Contents move to sidebar hide (Top) 1 Notes Toggle the table of contents Robert Robinson (cricketer, born 1924) 2 languages العربية اردو Edit links Article Talk English Read Edit View history Tools Tools move to sidebar hide Actions Read Edit View history General What links here Related changes Upload file Permanent link Page information Cite this page Get shortened URL Download QR code Print/export Download as PDF Printable version In other projects Wikidata item Appearance move to sidebar hide From Wikipedia, the free encyclopedia English cricketer Robert Geoffrey Robinson was an English cricketer active from 1929 to 1948 who played for Northamptonshire (Northants). He was born in Wellingborough on 23 September 1924 and died there on 21 December 1973. He appeared in four first-class matches as a righthanded batsman who bowled left-arm orthodox spin . He scored 85 runs with a highest score of 53 and took no wickets . [ 1 ] Notes [ edit ] ^ Robert Robinson at CricketArchive This biographical article related to an English cricket person born in the 1920s is a stub . You can help Wikipedia by expanding it . v t e Retrieved from \" https://en.wikipedia.org/w/index.php?title=Robert_Robinson_(cricketer,_born_1924)&oldid=1266537899 \" Categories : 1924 births Cricketers from Wellingborough 1973 deaths English cricketers Northamptonshire cricketers 20th-century English sportsmen English cricket biography, 1920s birth stubs Hidden categories: Articles with short description Short description is different from Wikidata Use dmy dates from March 2016 Use British English from March 2016 All stub articles This page was last edited on 1 January 2025, at 03:07 (UTC) . Text is available under the Creative Commons Attribution-ShareAlike 4.0 License ;\nadditional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy . Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc. , a non-profit organization. Privacy policy About Wikipedia Disclaimers Contact Wikipedia Code of Conduct Developers Statistics Cookie statement Mobile view Search Search Toggle the table of contents Robert Robinson (cricketer, born 1924) 2 languages Add topic"
    },
    "6": {
        "url": "https://en.wikipedia.org/wiki/Wikipedia:About",
        "text": "Wikipedia:About - Wikipedia Jump to content Main menu Main menu move to sidebar hide Navigation Main page Contents Current events Random article About Wikipedia Contact us Contribute Help Learn to edit Community portal Recent changes Upload file Special pages Search Search Appearance Donate Create account Log in Personal tools Donate Create account Log in Pages for logged out editors learn more Contributions Talk Wikipedia : About 138 languages Afrikaans Alemannisch Алтай тил अंगिका Аԥсшәа العربية Aragonés অসমীয়া Asturianu Avañe'ẽ Azərbaycanca تۆرکجه বাংলা Banjar Башҡортса Беларуская Беларуская (тарашкевіца) भोजपुरी Bikol Central Български Boarisch བོད་ཡིག Català Чӑвашла Cebuano Chi-Chewa Cymraeg Dansk الدارجة Davvisámegiella Deutsch ދިވެހިބަސް Diné bizaad Ελληνικά Español Euskara فارسی Føroyskt Français Frysk Galego ГӀалгӀай 贛語 ગુજરાતી 𐌲𐌿𐍄𐌹𐍃𐌺 한국어 Հայերեն हिन्दी Bahasa Hulontalo Ilokano Bahasa Indonesia Interlingua Ирон Íslenska Italiano עברית Jawa ಕನ್ನಡ Kapampangan कॉशुर / کٲشُر Қазақша Kiswahili Kurdî Кыргызча Latviešu Lëtzebuergesch Lietuvių Magyar Македонски Malti Māori მარგალური مصرى مازِرونی Bahasa Melayu Монгол မြန်မာဘာသာ Nederlands नेपाली 日本語 Нохчийн Nordfriisk Norsk bokmål Norsk nynorsk ꆇꉙ ଓଡ଼ିଆ Oʻzbekcha / ўзбекча ਪੰਜਾਬੀ ပအိုဝ်ႏဘာႏသာႏ ភាសាខ្មែរ Polski Português Qaraqalpaqsha Română Runa Simi Русский Саха тыла Sängö Scots Shqip සිංහල Simple English سنڌي Slovenčina Slovenščina Словѣньскъ / ⰔⰎⰑⰂⰡⰐⰠⰔⰍⰟ Soomaaliga کوردی Српски / srpski Srpskohrvatski / српскохрватски Sunda Suomi Svenska Tagalog தமிழ் Татарча / tatarça တႆး తెలుగు ไทย Тоҷикӣ Türkçe Türkmençe Tyap Удмурт Українська اردو ئۇيغۇرچە / Uyghurche Tiếng Việt Walon Winaray Wolof 吴语 ייִדיש Yorùbá 粵語 Zazaki 中文 ꠍꠤꠟꠐꠤ Edit links Project page Talk English Read View source View history Tools Tools move to sidebar hide Actions Read View source View history General What links here Related changes Upload file Permanent link Page information Get shortened URL Download QR code Print/export Download as PDF Printable version In other projects Wikimedia Commons Wikimedia Foundation MediaWiki Meta-Wiki Multilingual Wikisource Wikispecies Wikidata Wikifunctions Wikimania Wikinews Wikiquote Wikisource Wikivoyage Wiktionary Wikidata item Appearance move to sidebar hide From Wikipedia, the free encyclopedia Introduction to English language Wikipedia Shortcuts WP:ABT WP:ABOUT WP:WIKIPEDIA This is a general introduction for visitors to Wikipedia. For aspiring contributors, also see this guide and tutorial . For other uses, see Wikipedia:Wikipedia (disambiguation) . \"Imagine a world in which every single person on the planet is given free access to the sum of all human knowledge. That's what we're doing.\" — Jimmy Wales Wikipedia is a free online encyclopedia that anyone can edit, and millions already have . Wikipedia's purpose is to benefit readers by presenting information on all branches of knowledge . Hosted by the Wikimedia Foundation , Wikipedia consists of freely editable content, with articles that usually contain numerous links guiding readers to more information. Written collaboratively by volunteers known as Wikipedians , Wikipedia articles can be edited by anyone with Internet access , except in limited cases in which editing is restricted to prevent disruption or vandalism . Since its creation on January 15, 2001 , it has grown into the world's largest reference website , attracting over a billion visitors each month . Wikipedia currently has more than sixty-four million articles in more than 300 languages , including 6,994,536 articles in English , with 118,797 active contributors in the past month. Wikipedia's fundamental principles are summarized in its five pillars . While the Wikipedia community has developed many policies and guidelines , new editors do not need to be familiar with them before they start contributing. Anyone can edit Wikipedia's text, data, references, and images. The quality of content is more important than the expertise of who contributes it. Wikipedia's content must conform with its policies , including being verifiable by published reliable sources . Contributions based on personal opinions , beliefs, or personal experiences, unreviewed research , libellous material, and copyright violations are not allowed, and will not remain. Wikipedia's software makes it easy to reverse errors, and experienced editors watch and patrol bad edits. Wikipedia differs from printed references in important ways . Anyone can instantly improve it, add quality information, remove misinformation, and fix errors and vandalism . Since Wikipedia is continually updated, encyclopedic articles on major news events appear within minutes. For over 24 years, editors have volunteered their time and talents to create history's most comprehensive encyclopedia while providing references and other resources to researchers worldwide (see Researching with Wikipedia ). In summary, Wikipedia has tested the wisdom of the crowd since 2001 and has found that it succeeds. To start editing simply click the Edit or Edit source button, or the pencil icon , at the top of any non-protected Wikipedia page or section. v t e Basic information on Wikipedia - ( Search ) Help directory menu Teahouse (interactive help for new editors) About Wikipedia Readers' index to Wikipedia Statistics Administration FAQs Purpose Who writes Wikipedia? Organization Censorship In brief General disclaimer Readers' FAQ Student help Navigation Searching Viewing media Help Mobile access Parental advice Other languages Researching with Wikipedia Citing Wikipedia Copyright Introductions to contributing Main introduction List of tutorials and introductions The answer Dos and don'ts Learning the ropes Common mistakes Newcomer primer Simplified ruleset The \"Missing Manual\" Your first article Wizard Young Wikipedians The Wikipedia Adventure Accounts Why create an account? Logging in Email confirmation Editing Toolbar Conflict VisualEditor User guide Pillars, policies and guidelines Five pillars Manual of Style Simplified Etiquette Expectations Oversight Principles Ignore all rules The rules are principles Core content policies Policies and guidelines Vandalism Appealing blocks What Wikipedia is not Getting help Help menu Help desk Reference Desk Category Requests for help Disputes resolution requests IRC live chat Tutorial Contact us Wikipedia community Departments Meetups WikiProjects Overview FAQ Village pump policy technical proposals idea lab wikimedia misc Newsletters : Signpost Library Newsletter GLAM Newsletter Informational: Community portal Dashboard Noticeboards Maintenance Task Center Essays Open letters Sourcing and referencing Research Wikipedia Library Request Resources Free resources Request access to major databases WikiProject Resource Exchange Shared resources Guidelines Finding sources Combining sources Referencing Citations Citation Style 1 Citation templates Footnotes Page numbers Cite errors How-to guides Category Tools Infoboxes Writing articles Development Better writing Files Images Media files Uploading Deletion User contribution pages Editing pages Diffs Namespaces Deletion Merging Renaming Requests Redirecting Reverting Vandalism cleanup Talk pages Archiving Wiki markup Wiki markup Cheatsheet Columns HTML Lists Magic words For beginners Sections Sounds Special Characters Tables Templates Documentation Index Substitution Transclusion Image and video markup Tutorial Linking Directories and glossaries Category Abbreviations Contents Edit summaries Essays Glossary Index Shortcuts Tips Retrieved from \" https://en.wikipedia.org/w/index.php?title=Wikipedia:About&oldid=1289828186 \" Category : Wikipedia basic information Hidden categories: Wikipedia semi-protected project pages Wikipedia move-protected project pages This page was last edited on 11 May 2025, at 03:21 (UTC) . Text is available under the Creative Commons Attribution-ShareAlike 4.0 License ;\nadditional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy . Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc. , a non-profit organization. Privacy policy About Wikipedia Disclaimers Contact Wikipedia Code of Conduct Developers Statistics Cookie statement Mobile view Search Search Wikipedia : About 138 languages Add topic"
    },
    "7": {
        "url": "https://en.wikipedia.org/wiki/Wikipedia:Contact_us",
        "text": "Wikipedia:Contact us - Wikipedia Jump to content Main menu Main menu move to sidebar hide Navigation Main page Contents Current events Random article About Wikipedia Contact us Contribute Help Learn to edit Community portal Recent changes Upload file Special pages Search Search Appearance Donate Create account Log in Personal tools Donate Create account Log in Pages for logged out editors learn more Contributions Talk Wikipedia : Contact us 79 languages Alemannisch अंगिका العربية Azərbaycanca تۆرکجه বাংলা Banjar 閩南語 / Bân-lâm-gú Basa Banyumasan भोजपुरी Български Català Čeština Cymraeg Dansk الدارجة Davvisámegiella Deutsch Eesti Ελληνικά Español Esperanto فارسی Français 한국어 हिन्दी Hrvatski Bahasa Indonesia Italiano עברית Jawa ქართული Кыргызча Latviešu Lëtzebuergesch Magyar Malti Bahasa Melayu မြန်မာဘာသာ Nederlands 日本語 Norsk bokmål Norsk nynorsk Occitan ଓଡ଼ିଆ Oʻzbekcha / ўзбекча پښتو Plattdüütsch Polski Português Română Русиньскый Русский Scots Shqip සිංහල Simple English سنڌي Slovenčina Slovenščina کوردی Српски / srpski Srpskohrvatski / српскохрватски Sunda Suomi Svenska Tagalog Татарча / tatarça తెలుగు ไทย Тоҷикӣ Türkçe Українська اردو Vèneto Tiếng Việt ייִדיש 粵語 中文 Edit links Project page Talk English Read View source View history Tools Tools move to sidebar hide Actions Read View source View history General What links here Related changes Upload file Permanent link Page information Get shortened URL Download QR code Print/export Download as PDF Printable version In other projects Wikimedia Commons Meta-Wiki Wikibooks Wikinews Wikiquote Wikiversity Wikivoyage Wiktionary Wikidata item Appearance move to sidebar hide From Wikipedia, the free encyclopedia Introduction Readers How to report a problem with an article, or find out more information. Article subjects Problems with articles about you, your company, or somebody you represent. Licensing How to copy Wikipedia's information, donate your own, or report unlicensed use of your information. Donors Find out about the process, how to donate, and information about how your money is spent. Press and partnerships If you're a member of the press looking to contact Wikipedia, or have a business proposal for us. Back to main page Thank you for your interest in contacting Wikipedia. Before proceeding, some important disclaimers: Wikipedia has no central editorial board. Contributions are made by a large number of volunteers at their own discretion. Edits are neither the responsibility of the Wikimedia Foundation (the organisation that hosts the site) nor of its staff and edits will not generally be made in response to an email request. Although Wikipedia was founded by Jimmy Wales , he is not personally responsible for our content. If you have questions about the concept of Wikipedia rather than a specific problem, the About Wikipedia page may help. If you want to ask other users for help with editing or using Wikipedia, stop by the Teahouse , Wikipedia's live help channel , or the help desk to ask someone for assistance. If you disagree with an article's content, or are involved in a content dispute, see Dispute resolution . The links on the left should direct you to how to contact us or resolve problems. If you cannot find your issue listed there, you can email helpful, experienced volunteers at info-en wikimedia.org . Please refrain from emailing about disagreements with content; they will not be resolved via email. Retrieved from \" https://en.wikipedia.org/w/index.php?title=Wikipedia:Contact_us&oldid=967537943 \" Categories : Wikipedia tutorials Wikipedia quick introductions This page was last edited on 13 July 2020, at 20:45 (UTC) . Text is available under the Creative Commons Attribution-ShareAlike 4.0 License ;\nadditional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy . Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc. , a non-profit organization. Privacy policy About Wikipedia Disclaimers Contact Wikipedia Code of Conduct Developers Statistics Cookie statement Mobile view Search Search Wikipedia : Contact us 79 languages Add topic"
    },
    "8": {
        "url": "https://en.wikipedia.org/wiki/Help:Contents",
        "text": "Help:Contents - Wikipedia Jump to content Main menu Main menu move to sidebar hide Navigation Main page Contents Current events Random article About Wikipedia Contact us Contribute Help Learn to edit Community portal Recent changes Upload file Special pages Search Search Appearance Donate Create account Log in Personal tools Donate Create account Log in Pages for logged out editors learn more Contributions Talk Help : Contents 188 languages Acèh Afrikaans Alemannisch አማርኛ अंगिका Ænglisc العربية Aragonés ܐܪܡܝܐ Asturianu Avañe'ẽ Авар Aymar aru Azərbaycanca تۆرکجه বাংলা Banjar 閩南語 / Bân-lâm-gú Basa Banyumasan Башҡортса Беларуская Беларуская (тарашкевіца) भोजपुरी Bislama Boarisch བོད་ཡིག Bosanski Brezhoneg Català Чӑвашла Cebuano Čeština Chavacano de Zamboanga Cymraeg Dansk الدارجة Davvisámegiella Deutsch Diné bizaad Dolnoserbski डोटेली ཇོང་ཁ Eesti Ελληνικά Español Esperanto Euskara فارسی Føroyskt Français Frysk Gaeilge Gàidhlig Galego ГӀалгӀай ગુજરાતી 客家語 / Hak-kâ-ngî 한국어 Hausa Հայերեն हिन्दी Hornjoserbsce Hrvatski Bahasa Hulontalo Ido Ilokano Bahasa Indonesia Interlingua Interlingue Ирон Íslenska Italiano עברית Jawa Kalaallisut ಕನ್ನಡ ქართული कॉशुर / کٲشُر Қазақша Kernowek Ikirundi Kiswahili Kreyòl ayisyen Kurdî Кыргызча Ladin Ladino ລາວ Latina Latviešu Lëtzebuergesch Lietuvių Li Niha Limburgs Lingála Lombard Magyar Македонски മലയാളം Malti Māori मराठी مصرى Bahasa Melayu Minangkabau 閩東語 / Mìng-dĕ̤ng-ngṳ̄ Mirandés Монгол မြန်မာဘာသာ Nederlands Nedersaksies नेपाली नेपाल भाषा 日本語 Napulitano Нохчийн Norsk bokmål Norsk nynorsk Occitan ଓଡ଼ିଆ Oʻzbekcha / ўзбекча ပအိုဝ်ႏဘာႏသာႏ Papiamentu پښتو ភាសាខ្មែរ Piemontèis Plattdüütsch Polski Português Qırımtatarca Ripoarisch Română Rumantsch Runa Simi Русский Саха тыла संस्कृतम् Sardu Scots Seeltersk Shqip Sicilianu සිංහල Simple English سنڌي Slovenčina Slovenščina Словѣньскъ / ⰔⰎⰑⰂⰡⰐⰠⰔⰍⰟ Ślůnski Soomaaliga کوردی Српски / srpski Srpskohrvatski / српскохрватски Sunda Suomi Svenska Tagalog தமிழ் Татарча / tatarça တႆး తెలుగు ไทย Тоҷикӣ Lea faka-Tonga Tsetsêhestâhese ತುಳು Türkçe Türkmençe Twi Тыва дыл Удмурт Basa Ugi Українська اردو ئۇيغۇرچە / Uyghurche Vèneto Vepsän kel’ Tiếng Việt Volapük Võro Walon West-Vlams 吴语 ייִדיש 粵語 Zazaki Žemaitėška 中文 Edit links Help page Talk English Read View source View history Tools Tools move to sidebar hide Actions Read View source View history General What links here Related changes Upload file Permanent link Page information Get shortened URL Download QR code Print/export Download as PDF Printable version In other projects Wikimedia Commons MediaWiki Meta-Wiki Multilingual Wikisource Wikispecies Wikibooks Wikidata Wikifunctions Wikinews Wikiquote Wikisource Wikiversity Wikivoyage Wiktionary Wikidata item Appearance move to sidebar hide From Wikipedia, the free encyclopedia Main page of the help namespace This page provides help with the most common questions about Wikipedia . You can also search Wikipedia's help pages using the search box below, or browse the Help menu or the Help directory . Help Wikipedia Read or find an article The Readers' FAQ and our about page contain the most commonly sought information about Wikipedia. For simple searches, there is a search bar at the top of every page. Type what you are looking for in the box. Suggested matches will appear in a dropdown list. Select any page in the list to go to that page. Or, select the \"Search\" button, or press ↵ Enter , to go to a full search result. For advanced searches, see Help:Searching . There are other ways to browse and explore Wikipedia articles; many can be found at Wikipedia:Contents . See our disclaimer for cautions about Wikipedia's limitations. For mobile access , press the mobile view link at the very bottom of every desktop view page. Edit an article Contributing is easy: see how to edit a page . For a quick summary on participating, see contributing to Wikipedia , and for a friendly tutorial, see our introduction . For a listing of introductions and tutorials by topic, see getting started . The Simplified Manual of Style and Cheatsheet can remind you of basic wiki markup . Be bold in improving articles! When adding facts, please provide references so others may verify them. If you are affiliated with the article subject, please see our conflict of interest guideline . The simple guide to vandalism cleanup can help you undo malicious edits. If you're looking for places you can help out, the Task Center is the place to go, or check out what else is happening at the community portal . You can practice editing and experiment in a sandbox your sandbox . Report a problem with an article If there is a problem with an article about yourself, a family member, a friend or a colleague, please read Biographies of living persons/Help . If you spot a problem with an article, you can fix it directly, by clicking on the \"Edit\" link at the top of that page. See the \"edit an article\" section of this page for more information. If you don't feel ready to fix the article yourself, post a message on the article's talk page . This will bring the matter to the attention of others who work on that article. There is a \"Talk\" link at the beginning of every article page. You can contact us . If it's an article about you or your organization, see Contact us – Subjects . Create a new article or upload media Check Your first article to see if your topic is appropriate, then the Article wizard will walk you through creating the article. Once you have created an article, see Writing better articles for guidance on how to improve it and what to include (like reference citations ). For contributing images, audio or video files, see the Introduction to uploading images . Then the Upload wizard will guide you through that process. FAQ and interactive help Answers to common problems can be found at frequently asked questions . Or check out where to ask questions or make comments . New users should seek help at the Teahouse if they're having problems while editing Wikipedia. More complex questions can be posed at the Help desk . Volunteers will respond as soon as they're able. Or ask for help on your talk page and a volunteer will visit you there! You can get live help with editing in the help chatroom . For help with technical issues, ask at the Village pump . Factual questions If searching Wikipedia has not answered your question ( for example, questions like \"Which country has the world's largest fishing fleet?\" ), try the Reference Desk . Volunteers there will attempt to answer your questions on any topic, or point you toward the information you need. Directories Directory : main list of directories and indexes. Help related Help directory : for informative, instructional and consultation pages. Request directory : for services and assistance that can be requested on Wikipedia. Protocols and conventions Policy directory : official policies for \"English Wikipedia\". Guideline directory : official guidelines for \"English Wikipedia\". Manual of Style directory : pages related to the style manual of Wikipedia articles. Community related Departments : for the different divisions of Wikipedia. Editor's index : for everything an editor needs to know to work on Wikipedia. Essay directory : for Wikipedia namespace essays. Dashboard : for current discussions taking place throughout Wikipedia. WikiProjects : for people who want to work together as a team to improve Wikipedia. MediaWiki software Wikitext : for the syntax used by Wikipedia to format a page. HTML : for HTML5 elements, or tags and their attribute. Templates : for templates used within Wikipedia. Help by topic Help Menu : for searching by subject matter. Navigating Wikipedia : for searching and browsing the encyclopedia. Joining Wikipedia : how to get involved. Editing Wikipedia : has general help for editors. Links and references : has help for creating links, or dealing with references Images and media : how to use images, videos and sound files. Keeping track of changes : how to track the evolution of a page, or follow a user. Policies and guidelines : for community standards. Asking questions : volunteers will attempt to answer. The Wikipedia community : how to submit or debate a proposal. Resources and lists : has resources for editors. Account settings : has tips and tools for registered users. Technical information : has tools for advanced users, and troubleshooting. Site map : is the above thirteen pages on one single page. Tip of the day Citation footnotes Use the <ref> tag to add references to your articles presented as footnotes.  This tag is easy and convenient because it allows you to cite your sources within your text and have them automatically numbered and added to your References section at the end of the article.  To cite a source, simply type the <ref> tag after the statement the reference is for. For example: Haliburton park is the largest park in the world.<ref>Bill Harton (2005).  http://www.linkhere.com. Retrieved March 3, 2005.</ref> Then, at the end of your article, add the following template to include all of the citations in your article: {{Reflist}} directly under the References or Notes section title. Prior tip – Tips library – Next tip Read more: Help:Footnotes Become a Wikipedia tipster – Tips library, by subject To add this auto-updating daily tip to your user page, use {{ totd }} Additional searches Search Frequently Asked Questions Search the help desk archives v t e Basic information on Wikipedia - ( Search ) Help directory menu Teahouse (interactive help for new editors) About Wikipedia Readers' index to Wikipedia Statistics Administration FAQs Purpose Who writes Wikipedia? Organization Censorship In brief General disclaimer Readers' FAQ Student help Navigation Searching Viewing media Help Mobile access Parental advice Other languages Researching with Wikipedia Citing Wikipedia Copyright Introductions to contributing Main introduction List of tutorials and introductions The answer Dos and don'ts Learning the ropes Common mistakes Newcomer primer Simplified ruleset The \"Missing Manual\" Your first article Wizard Young Wikipedians The Wikipedia Adventure Accounts Why create an account? Logging in Email confirmation Editing Toolbar Conflict VisualEditor User guide Pillars, policies and guidelines Five pillars Manual of Style Simplified Etiquette Expectations Oversight Principles Ignore all rules The rules are principles Core content policies Policies and guidelines Vandalism Appealing blocks What Wikipedia is not Getting help Help menu Help desk Reference Desk Category Requests for help Disputes resolution requests IRC live chat Tutorial Contact us Wikipedia community Departments Meetups WikiProjects Overview FAQ Village pump policy technical proposals idea lab wikimedia misc Newsletters : Signpost Library Newsletter GLAM Newsletter Informational: Community portal Dashboard Noticeboards Maintenance Task Center Essays Open letters Sourcing and referencing Research Wikipedia Library Request Resources Free resources Request access to major databases WikiProject Resource Exchange Shared resources Guidelines Finding sources Combining sources Referencing Citations Citation Style 1 Citation templates Footnotes Page numbers Cite errors How-to guides Category Tools Infoboxes Writing articles Development Better writing Files Images Media files Uploading Deletion User contribution pages Editing pages Diffs Namespaces Deletion Merging Renaming Requests Redirecting Reverting Vandalism cleanup Talk pages Archiving Wiki markup Wiki markup Cheatsheet Columns HTML Lists Magic words For beginners Sections Sounds Special Characters Tables Templates Documentation Index Substitution Transclusion Image and video markup Tutorial Linking Directories and glossaries Category Abbreviations Contents Edit summaries Essays Glossary Index Shortcuts Tips Shortcuts to this page: WP:HELP WP:H Retrieved from \" https://en.wikipedia.org/w/index.php?title=Help:Contents&oldid=1283050621 \" Categories : Help Wikipedia help contents Hidden categories: Wikipedia semi-protected project pages Wikipedia move-protected project pages This page was last edited on 30 March 2025, at 03:57 (UTC) . Text is available under the Creative Commons Attribution-ShareAlike 4.0 License ;\nadditional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy . Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc. , a non-profit organization. Privacy policy About Wikipedia Disclaimers Contact Wikipedia Code of Conduct Developers Statistics Cookie statement Mobile view Search Search Help : Contents 188 languages Add topic"
    },
    "9": {
        "url": "https://en.wikipedia.org/wiki/Help:Introduction",
        "text": "Help:Introduction - Wikipedia Jump to content Main menu Main menu move to sidebar hide Navigation Main page Contents Current events Random article About Wikipedia Contact us Contribute Help Learn to edit Community portal Recent changes Upload file Special pages Search Search Appearance Donate Create account Log in Personal tools Donate Create account Log in Pages for logged out editors learn more Contributions Talk Help : Introduction 117 languages Afrikaans Alemannisch Ænglisc Аԥсшәа العربية Arpetan অসমীয়া Авар تۆرکجه Basa Bali বাংলা 閩南語 / Bân-lâm-gú Basa Banyumasan Башҡортса Български Boarisch Bosanski Буряад Català Cebuano Čeština Cymraeg Davvisámegiella Deutsch Eesti Ελληνικά Español Esperanto Euskara فارسی Føroyskt Français Gaeilge Gaelg Gàidhlig Galego 한국어 Հայերեն Hrvatski Bahasa Hulontalo Bahasa Indonesia Interlingua Íslenska Italiano עברית Jawa Kapampangan Къарачай-малкъар ქართული कॉशुर / کٲشُر Қазақша Kreyòl ayisyen Kurdî Кыргызча Ladin Ladino ລາວ Latina Latviešu Lëtzebuergesch Lietuvių Limburgs Magyar मैथिली Македонски മലയാളം Malti مصرى Bahasa Melayu ꯃꯤꯇꯩ ꯂꯣꯟ Монгол မြန်မာဘာသာ Nederlands 日本語 Napulitano Norsk bokmål Norsk nynorsk ਪੰਜਾਬੀ ပအိုဝ်ႏဘာႏသာႏ پښتو ភាសាខ្មែរ Plattdüütsch Polski Română Romani čhib Runa Simi Русский संस्कृतम् Sardu Scots Sicilianu සිංහල Simple English سنڌي Slovenčina Slovenščina کوردی Српски / srpski Sunda Suomi Svenska Tagalog Tarandíne Татарча / tatarça တႆး తెలుగు ไทย Türkçe Удмурт Українська اردو ئۇيغۇرچە / Uyghurche Vahcuengh Tiếng Việt ייִדיש 中文 ᥖᥭᥰ ᥖᥬᥲ ᥑᥨᥒᥰ Edit links Help page Talk English Read View source View history Tools Tools move to sidebar hide Actions Read View source View history General What links here Related changes Upload file Permanent link Page information Get shortened URL Download QR code Print/export Download as PDF Printable version In other projects Multilingual Wikisource Wikifunctions Wikisource Wikiversity Wikidata item Appearance move to sidebar hide From Wikipedia, the free encyclopedia Tutorial for new editors Introduction to Wikipedia Wikipedia is made by people like you . This page takes you through a set of tutorials aimed at complete newcomers who wish to contribute. It covers all the basics, and each tutorial takes only a few minutes, so you can become a proficient Wikipedian quickly. Get started Policies and Guidelines The wiki markup source editor shows the underlying page source code. It works like a plain text file, indicating links and other items using simple code like this: [[Earth]] . Editing Referencing Images Tables VisualEditor is the easier way of editing that works more like a word processor and hides the underlying source code. Links and other items are edited using toolbar and pop-up interfaces. Editing Referencing Images Tables Talk pages Navigating Wikipedia Manual of Style Conclusion View all as single page Help Wikipedia Shortcuts WP:I H:I H:INTRO For more training information, see also: Full help contents page Training for students A single-page guide to contributing A training adventure game Resources for new editors Please consider leaving us some feedback. Retrieved from \" https://en.wikipedia.org/w/index.php?title=Help:Introduction&oldid=1286675512 \" Category : Wikipedia quick introductions Hidden category: Wikipedia semi-protected project pages This page was last edited on 21 April 2025, at 09:39 (UTC) . Text is available under the Creative Commons Attribution-ShareAlike 4.0 License ;\nadditional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy . Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc. , a non-profit organization. Privacy policy About Wikipedia Disclaimers Contact Wikipedia Code of Conduct Developers Statistics Cookie statement Mobile view Search Search Help : Introduction 117 languages Add topic"
    }
}